game_design_notes.org
《游戏设计艺术》笔记

读此书，随手记笔记，还对比《大明浮生记》和其他项目的一些设定，进行了反思。

