game_design_notes.org
* version history
** V1.1  2014年11月28日 11:47:01
补充了透镜63：美好事务的透镜。
补充了透镜75：玩家化身的透镜。
补充了实战：改《绝对领域》的几个思路和做法。
** V1.010   2014年07月09日 13:11:50
添加了"时间的透镜"和"处罚的透镜"。
-

** V1.009   2014年04月08日 13:49:56
补充了一些细节，如本质体验，心流。
修改了若干字。

**  V1.008  2013年12月23日 19:44:05
1. 补充了104透镜：凯尔文勋爵的透镜


**  V1.007  2013年12月19日 20:13:53
1. 补充了103透镜：魔法尺寸的透镜。
2. 补充了体验第一的实例。

**  V1.006  2013年12月14日 15:55:10
1, 补充了间接控制、合谋的透镜。
2, 重点阐述了1.5的动态体验三曲线（难度，认知和兴趣），并分析实际情况。
3, 体验改进的累积性

**  V1.005  2013年12月05日 17:56:09
补充了奖励透镜的实际设计例子
补充了透镜102：“得到与失去”的透镜。

**  V1.004  2013年11月08日 16:43:27
补充了原作者的访谈，其内容是对书本的有益补充。
补充了透镜101
补充了skinner box


**  V1.003  2013年08月14日 12:37:52
补充了特色的透镜。
对透镜0进行了整理，条理更清楚。
**  V1.002  2013年07月31日 13:48:24
补充了多汁透镜，bafang秘籍。

**  v1.001  2013年05月20日 12:28:16
一些细节改进。尤其是对某些奇葩手游的观察。

**  原始版本 2013年05月18日 12:51:36

比较完善了。

好几个透镜缺。

格式不统一。

* 前言
** 什么是游戏设计？
   游戏设计，就是做出一系列决策，来决定一个游戏该是什么样子。

** 本书试图诱导读者，从各种不同的角度来思考、审查游戏。
   这些角度被叫做透镜。

** 聚焦最基础。
   现在的游戏眼花缭乱，我们要聚焦最本质、最基础的。分析经典旧游戏。游戏设计基础，乃在于人类心理学。

** 功夫在诗外(Talk to stangers):
   万物一理，All knowledge is related。设计好游戏，就得走进生活，尝试所有事情。

** 真正的设计，在于动手实践。
   本书只能是一个开始。

** 构建你的设计地图(Map)
   要在你的脑子中，构建一个关于游戏设计的地图。本书末尾提供了一个。
* 透镜-1:  Skinner Box
  游戏是对人的一种操纵。Skinner Box是一种描述这种操纵的模型。

** TODO SkinnerBox的详细描述以及在游戏中的应用。
   
* 透镜0: 突破想像范围的透镜
  此透镜非官方透镜，而是通过游戏设计实践悟出的。

  玩家天然喜新厌旧，总是在游戏中寻求新的体验。无论多么优秀的游戏，都会随着时间的流逝失去魅力（或边际乐趣）。

  对于某一个题材游戏、某一个主题游戏，人们会预先存在一个想像范围A，它是由常识、历史因袭、当时同类产品形成的行业惯例等决定的。

  如果游戏产品P落于这个A范围之内，则无法没有给人们边际乐趣和边际惊喜（边际是指“额外增加的”，参见《微观经济学》），就会被认为是一个平庸的产品，将被湮灭在
同类产品之中，属于同质化产品，缺乏传播（无论是媒体传播还是受众口口相传）价值。

  因此，产品要胜出，它必须突破这种想像范围。游戏的机制（玩法）、美术、故事、技术，综合体验，甚至缺陷变态设定等，只要有一个或一个以上突围，则产品被认为是
“有特色”的，就会给受众额外的乐趣、注意力和惊喜感，甚至引起口碑传播和媒体注意。案例：日本alpca, tengami, 西方的sworcery, Clumsy Ninja, 纪念碑谷，都是
超过了当时玩家群想象范围的作品，引起了轰动和口碑传播。 

** [更多论据]
中里伸也： 第一个原则，我们总要考虑给玩家提供不同的惊喜。
我在这里与其给大家看，不如给大家演示一下。（观看视频）这是《魂斗罗3》的最后一个BOSS，下面是 中BOSS，先出现的直升飞机，发了导弹，刚才从横向转为3D。在这里，直升飞机会下来变成一个机器人，会有一个大的乌龟。大家看到这儿，一定会觉得它是 最大的BOSS了吧？其实在经过了一定的打之后，这个才是最后的BOSS。

就像这样，你不能跟着玩家的想法去走，一定要超越玩家的想象。如果有一个想法成功的话，下次再用这样的想法，恐怕玩家不会再买账了。每次想出来唯一的、不同的想法，这个其实是游戏制作人员的一个最该做的事情。

批注：金庸写小说，也是同样的思路和做法，他找几个读者聊天，让他们想象小说的下一阶段是怎么样的，然后金庸一定写出和这些读者想象不一样的东西，给读者最大惊喜感。
一定要超越玩家想象才行。

*** 市场营销
市场营销手段，就是不断求新，同样手段不能再用，否则受众不认可。

** 问自己下面问题：

1. 我的游戏，市场上有同类产品吗？有同题材产品吗？如果有，那么人们对这类产品的想像范围是什么？

2. 我应该如何突破想像范围，而使产品有特色？

3. 具体来说，游戏的机制（玩法）、美术、故事、技术，综合体验，缺陷变态设定等方面，我的产品有哪个超越了想像范围？

* 透镜1：本质体验的透镜
** 透镜描述

停止思考你的游戏，开始思考玩家的体验。

*** 我想让玩家获得什么样的体验呢？
*** 这种体验中最本质的是什么呢？
《极品飞车》：飙车快感
《糖果粉碎传奇》：糖果之甜与爽透手感
《pictuireka!》:限时“寻找”东西。
*** 如何能让我的游戏捕捉到这种本质呢？
  
你需要清楚地描述出你想要的本质体验，然后寻找各种办法尽可能地把这种本质逐步灌输到你的游戏中。

**  wii sports的例子
  抓住了“挥动遥控器是游戏中最独特的”，去掉了当初想的尽可能像真实的棒球那样的想法。


我要批注  有时为了强调游戏的关键体验，可以去掉某些真实性和现实性。所谓"Keep fun, cut the rest",就是这个意思。

** 《找你妹》的例子

给女性玩家提供你“找”的这种独特体验。外加简单，无市场竞品。

** Dungeon Crawl

去掉了火炬，而且可以自动探索，就是抓住了地牢冒险战斗的本质体验，灭掉了多余的。


**  扩展描述

*** 体验的构成：是一不是二，是整体不是局部
我要批注  体验是由界面，声音，美术，数值等综合产生的。


*** 体验是游戏设计的指路灯，北斗星，大海航行的舵手，它告诉整个团队努力的方向，引导游戏的整个设计和改进过程
很多设计师都没有用上“本质体验的透镜”，在黑暗中摸索。
很多设计师都没有用上“本质体验的透镜”，在游戏中掺杂其他体验，偏离了本质。

游戏设计师最终目标是传达一种体验，当你对你理想中的体验及其本质元素有着清晰的了解时，  你的设计就有了某种可以追求的目标了。

假设没有这种目标，你只能是不断在黑暗中游荡而已。

*** 游戏品质的差异在体验

我要批注  同样的游戏机制和数值，由于包装不同，体验完全不同，一个可以被认为是好游戏，另一个可以是垃圾。

我要批注  体验第一，游戏第二。

我要批注  体验胜过游戏。游戏不是体验，游戏只是为了达到体验的手段之一。


***  体验的累积突变性
案例： jinzhu说，对战平台改产品体验，改一点，没效果，再改一点，还没效果，后来这种改进累积起来突然突变了，玩家的次日留存达到了37%,最终版本居然达到了50%
这说明：体验的改进，是一个厚积薄发的过程，需要通过积累逐步达到效果。很小的改进无效果不要紧，持续努力，积少成多，最终就突破了。

***  实例
bafang反对项目Z的第一关只有1.5屏物件，因为：
“感觉不对”

启示：
第一关只有1.5屏物件，虽然很容易了，但----这种设定改了原来产品在很多屏中找东西的感觉---也就是体验。
体验第一，其余第二。这不能只空谈，一定要落实到游戏设计上。

jelly defense出现了塔防和手动捡金币两种操作，把塔防策略本质体验搞偏移分散了。
游戏的设定，是否出现了对本质体验的偏差？比如试图搞两种以上的体验，不分主次？



* 透镜1.5  动态体验的透镜
游戏从玩家开始体验之时，就隐含三条动态变化的曲线，贯彻全过程：
** 一、认知曲线
开始一个新游戏后，玩家由对游戏设定（背景，人物，玩法，设定等）一点不知道，到
知道一些，到完全理解和掌握的过程。这个过程需要在认知上接受
游戏的设定。
认知曲线陡峭的话，会导致玩家在前期流失。
新手引导和各种提示是为了解决这个认知曲线问题的。

** 二、难度曲线
玩家在玩游戏过程中，遇到的难度问题，可量化为一条难度曲线。
难度曲线的设置很有讲究，太容易了，玩家觉得没有挑战性，就不玩了。太
难了，一部分玩家就会流失。
难之后要容易，容易之后要难。
给玩家选择难易（而且收益也与难易相关），参见三角透镜。
难度曲线贯彻游戏整个过程，需要仔细规划。

 
** 三、兴趣曲线 
这个，本书有单独的兴趣曲线透镜。

