game_design_notes.org
** 应用：以体验三曲线来分析2013年页游的困境

天朝的页游试图把认知曲线解决得更好，并大大降低游戏难度，好抓住玩家。具体表现是：
前期指导事无巨细，玩家可无脑地点击，后来发展到游戏无需玩家点击即可自己玩，
难度曲线的前端已经趴到x轴上不动了。
这是发展的极致啊。

但这种做法效果并不好。
1. 没有解决认知曲线的问题，因为玩家无脑点击，没有任何认知努力，所以没有学到什么东西，认知
曲线的问题仍然存在。
2. 没有解决兴趣曲线的问题。由于天朝页游大部分是三国、修仙和武侠，游戏画面和玩法基本
一样，高同质化，所以玩家见多识广，兴趣曲线总体上不来。
3. 难度曲线问题：一点难度都没有的游戏，玩家没有挑战感和存在感，也会失去兴趣。

因此，即使某些页游做到了游戏前期可以自己玩，也无法有效地提升玩家对游戏的忠诚度和兴趣。
页游，在激烈而无创新的竞争自己走偏了，而且越走越偏.....

** 应用：糖果的付费时机
[引文开始]
因此，做出一个决策、获得奖励，然后重复这些步骤，我们通过一些与此相似的镜头来考虑货币化的问题。
你会在什么时候引入这些决策，又或者说在这种情况下，你会在什么时候引入货币化？再一次，
你想要创造起情感依附，然后在正确的时间段中呈现这个货币化决策。
在游戏中呈现得太早了相当于在回绝你的玩家，如果你将它体现得太晚，你或许就是在放弃获得收入的机会。
一个精准时机的最佳案例可以在《糖果粉碎传奇》（Candy Crush Saga）中找到，在游戏的第十五关之后，
玩家们将不得不开始考虑，要么支付0.99美元，要么邀请三位好友帮忙。
如果游戏的货币化是在第七关呈现而不是在第十五关，这些玩家的情感依附是否还会一样呢？
[引文结束]
分析：
其实这糖果的难度曲线非常明显，并以此诱导玩家付费。第十五关是水果消除，难度较大。
第七关较为简单，玩家还没有完全被兴趣曲线吸引住，这时收费不合适。

* 透镜2:惊喜感的透镜
** 透镜描述
  惊喜感是如此的基础，使得我们会轻易地忽略它。利用这个透镜提醒你，在游戏中填入各种有趣的惊喜，问一下自己以下的问题。
*** 玩家在玩我游戏时，我会用什么来让玩家感到惊喜呢？
*** 我游戏的故事有让人惊喜的元素吗？各种游戏规则呢？美术部分呢？技术部分呢？

《大明浮生记》 美术部分的惊喜感能够一瞬间抓住玩家。

 故事是个老套故事。但老套故事容易让人理解。
*** 规则能让玩家相互制造惊喜吗？
   
《大明浮生记》的相互通缉，制造了这种惊喜感，因为玩家入狱后，【基于规则】会有别的玩家捞他出来。

*** 规则能让玩家自己制造惊喜吗？

   惊喜感是所有娱乐方式中至关重要的一部分-----它是幽默、策略和问题解决的基础。我们大脑是铁定喜欢惊喜感的。
在一次试验中，参加试验的人都会张开嘴去尝糖水和白开水，那些在两种水之间随机尝的人，比那些一直固定只品尝一种的人要感觉更快乐，即使他们品尝到的糖水的总量是一样的。

   
   抽奖是制造惊喜感的手段。

** 扩展描述
《大明》这个游戏，我会用什么来让玩家感到惊喜呢？

风格上，轻松快乐,戏搞

无所不在的幽默感

独特的游戏界面让人眼前一亮，避免了同质化。

** 应用1

《大明》的野怪中心，原先是若干无区别的野怪（等级稍微有差异的怪物，一律黑白颜色），玩家会觉得：
1.打多了，无惊喜感导致的厌倦 
2。无选择（或无明显区别的选择），
3.没有三角平衡（见透镜33)

改进： 

每波怪物中，随机出现零个或一个BOSS怪物，它是彩色的（参见透镜59：界面维度增加了颜色），难度大，
但是打了之后收益大。这样：

1. 有惊喜感
2. 玩家有了有意义的选择
3. 出现三角平衡（或打小怪得到平常收益，或打大怪得到大收益，但对玩家有风险）

上述设定中，利用了好几个透镜。


** 应用2
项目Z，主题之间的差异是一个重点。
玩家从一个主题进入到一个新的主题的时候，给予绚丽的界面效果显示新主题出现的新物件，并恭喜玩家，给予了玩家惊喜感。
隐藏关卡开启，也给予了玩家惊喜感。

* 透镜3: 乐趣的透镜
** 透镜描述
   乐趣几乎在每个游戏中都是需要的。尽管有时乐趣经不起分析。为了让你的游戏的乐趣得到最大化，问一下自己这些问题。

*** 我的游戏哪个部分有趣？为什么这么说？
*** 哪些部分需要变得更有趣？

涂鸦墙
通缉令---玩家互动
联盟地下室---很搞
杀怪的技能动画（理论上）

*哪些部分需要变得更有趣？

打工系统,它枯燥无聊，没什么特色
科举考试
打副本

* 透镜4 好奇心的透镜
** 透镜描述
*** 思考玩家真正的动机---它不单单是游戏中设定的各种目标，还包括了玩家想要达到这些目标的原因。问以下问题：
**** 我的游戏，在玩家脑海中根植了哪些问题呢？
**** 我做了哪些事情让玩家在意这些问题呢？
**** 如何能让玩家产生更多的问题呢？
** 扩展描述
例如，一个迷宫类的游戏可能在每个关卡里都有限时的目标，玩家在不断地问这个问题：“我可以在30秒内找到迷宫的出口吗？”
让玩家更在意这个问题的手法，可以在他们解决每个迷宫时有趣的动画上做文章，从而让玩家可能产生另外一个问题：“我很好奇下一段动画会是怎么样的。”

我要批注：  
《大明浮生记》的浮生历程，就是在他们解决每个城市进入的时候，动画上做文章，从而让玩家可能产生另外一个问题：“我很好奇下一个城市的动画会是怎么样的。”
《项目Z》，玩家会在意下一关出什么新物品？获得新东西？
<糖果>右上角有一个问号，打开出现“my name is Odus, pass level 50 to 
unlock new dreamly content!", 这种做法就是激发玩家好奇心。
* 透镜5  内生价值
** 透镜描述
*** 在我的游戏中哪些东西是对玩家有价值的？

**** 等级、经验、战功、金币。
**** "混“的指标---成就系统。
游戏的特别之处是”混“，而不是武功很强。
成就的指标对玩家是有价值的。

*** 思考下，哪些东西没有表现出价值？
**** 玩家采集到的特产（对玩家有什么价值？）
在前期，成为金币来源之一。
后期，成为名将喜好品。

如果突然让某特产的系统收购价提高，将导致金币来源控制不住。设计存在问题。

**** "混“的指标---成就系统。
游戏的特别之处是”混“，而不是武功很强。
成就的指标对玩家是有价值的。
**** PK威望
PK威望小于1300才能招。
大家不认可这个设定。

招人的条件：
PK威望高，加少数特产
PK威望低，加多个特产
都能让玩家耗时间。

*** 如何能让它们对玩家显得更有价值呢？

**** 成就系统分数越高，玩家在战斗中越厉害？或者越能用较少的钱成为VIP?
**** 玩家的特产越多，就越?
**** 玩家等级。技能。装备。能让玩家。。。。。

*** 游戏中的价值与玩家的动机如何链接起来？

玩家的动机是，放松？

玩家的动机是，娱乐？

玩家的动机是，搞笑？

如何连接起来？

** 扩展描述
记住，游戏中物品的价值和各种分数能直接反映出玩家有多在意在你的游戏中获得成功。

通过思考玩家真正在意什么，以及为什么在意这些，你通常能了解如何对游戏进行改良。
** 实际例子
Bubsy游戏中的纺线球：收集能得到更高分数，但玩家不在乎，也不收集。为什么呢？因为玩家的动机仅仅是完成关卡，高分对此无任何帮助，而且高分也无任何奖励。

对比：刺猬索尼克2, 你收集戒指，收集到的戒指对玩家很重要，有很大的内生价值----因为戒指能保护你不受敌人攻击，每收集100个戒指，能额外得到一条命。

《大明》的特产，现在也没有用处，无内生价值不强。

《大明》的混世技能，现在也没有用处，无内生价值不强。

《大明》的PK威望，现在也没有用处，无内生价值不强。


* 透镜6  问题解决的透镜

思考玩家要在你游戏中成功所必须解决的问题。
** 我的游戏让玩家去解决哪些问题？

自身升级成长

获得武器和技能

强化武器和技能

打副本通关，去更牛的城市

然后才能打败怪物和别的玩家

** 游戏中有些作为玩法中的一部分的隐藏问题需要解决吗？

** 如何能让我的游戏产生各种新的问题，以此来让玩家继续回来玩？

通缉系统能让玩家之间产生新的问题，因为玩家需要打败新玩家

隐藏地点的设计不错，因为玩家的等级，可能进入不了某个他发现的隐藏地点（或精英副本），所以对他来说，是一个产生新问题的机制，让玩家继续回来玩。

很多游戏对玩家过关进行评价，例如《保卫萝卜》，有的玩家为了一个好评价，不断玩同一关。

* 透镜7 基本四元组的透镜
** 透镜描述
游戏，是由机制、故事、技术和美感四元素组成的。

观察你游戏的组成，单独考虑它们，然后再整体地考察它们。

*** 我的游戏用上了机制、故事、技术和美感四个元素了吗？

故事要编写剧情。

***  我可以通过改良一种或多种元素来提升游戏吗？

最给力的主要是美感？


*** 这四种元素是相互协调，相互加强，为同一个主题服务吗？

一些设计师一直想着游戏内部运作的细节，但完全忽略了玩家的体验。

你不但要理解各种游戏元素及其相互的关联，你还必须一直考虑它们和体验之间的关系。

所以要同时关注游戏的皮肤（用户体验）和骨骼（游戏内在机制）


* 8 全息设计的透镜
** 透镜描述
你必须同时看到游戏中的每个方面：在看到四个元素以及玩家体验的同时，还看到它们之间的相互关联。你可以把注意力从游戏的皮肤和骨骼之间
来回切换，但更好的办法是，能全息地观察你的游戏和游戏的体验。
问：
*** 游戏中的哪些元素能使整个游戏变得愉悦？
