game_design_notes.org
*** 游戏中的哪些元素是削减这种体验的？
*** 如何调整这些元素来改良体验？

  To use this lens, you must see everything in your game at once: the four ele-
ments and the player experience, as well as how they interrelate. It is accepta-
ble to shift your focus from skin to skeleton and back again, but it is far better 
to view your game and experience holographically. 


** 扩展描述
其实，就是从游戏的表面体验到游戏的有机组成两个不同层次、以及它们如何相互作用来来观察游戏、改进游戏的设计。

这就是全息设计的本质。

游戏的皮肤：游戏体验。

游戏的骨骼：组成游戏的各元素。

一个可怕的陷阱：一些设计师，一直想着游戏内部运作的细节，但完全忽略了玩家的体验。

只关注游戏骨骼，或者只关注游戏的皮肤，都不全面。必须同时关注两个方面。

你要把注意力在游戏皮肤和骨骼之间来回切换。

*游戏中的哪些元素能使整个体验变得愉悦？

界面，语言。

*游戏总的哪些元素是削弱这种体验的？

冷却，特产，无法让玩家理解的技能。

*如何能调整这些游戏元素来改良体验？

前n次不需要冷却

特产有用化

技能简化，表现能力增加，搭配有趣

* 9 统一的透镜
*我游戏的主题是什么？

让玩家轻松搞笑地在明朝混，最终目的是当皇帝。

** 我用了每一种可能的方法去强化这个主题了吗？

美术方面，用诙谐简单的画面来表现，有一定的效果。

玩法方面，玩家从事的事情，有混的感觉。其实当前《大明》还没有强调这个，混的感觉相当淡化。

统一的透镜和基本的四元组透镜一起运用是很棒的。先分解，再综合它们为一个主题而服务。


* 10 共鸣的透镜

** 找能引起玩家共鸣的主题。

我们讨厌那种繁琐和累的武侠RPG，它们太同质化了，没意思。

我们工作已经很累了，让我们轻松点好吗？

我们看花花绿绿的艳俗游戏界面都厌倦了，想看漫画清新的界面

我们需要发自内心的愉悦感。

这些都是《大明》能引起共鸣的主题。

* 12 问题陈述的透镜
把你的游戏看成是对某个问题的解决方案

** 我到底在解决哪种问题呢？

武侠RPG很累的模式

游戏越做越雷同的方式

** 游戏真的是这个问题的最佳解决方案吗？为什么？

是的

** 我如何知道问题是否解决了呢？

当《大明》开始口碑传播。

* 筛选创意的八个步子

** 1. 美感上的刺激。
这个游戏感觉对头吗？
** 2.受众的统计数据
目标受众会足够喜欢这个游戏吗？
** 3. 体验设计
把你所知道的能用来创造一种出色的体验的所有东西都考虑进去，包括美感，兴趣曲线，共鸣的主题，游戏平衡，以及其他。
这是一个良好设计的游戏吗？
** 4. 创新
给玩家一些从来没有见过的东西.

这个游戏足够新颖吗？

** 5.商业和市场营销
这个游戏能卖得火吗？
** 6.技术角度
这个游戏在技术上有可能作出来吗？
** 7.社会/社区角度
这个游戏满足我们社会上的目标吗？
** 8.游戏测试
参加游戏测试的入足够喜欢这个游戏吗？


* 透镜13 八滤镜的透镜
你的设计必须满足众多的约束，只有当它无需再进行修改地通过了所有的八个滤镜时，你才能声称你的设计是最终成型的。
+这个游戏感觉对头吗？
+目标受众足够喜欢这个游戏吗？
+这是一个良好设计的游戏吗？
  我要批注  废话，什么叫“良好设计”的？如何量化和可评估呢？
+这个游戏足够新颖吗？
  我要批注  不错，挺新的。
+这个游戏会卖得火吗？
+这个游戏在技术上有可能做得出来吗？
+这个游戏满足我们社会上和社区上的目标吗？
我要批注  这是什么意思呢？
+参与测试的人，足够喜欢这个游戏吗？
我要批注  还好，有4%的人喜欢，而且成为了fans

* 游戏开发中的循环技术
** 1.提出一个基础设计
** 2.找出设计中最大的风险
** 3.建立各种原型来减轻这些风险
** 4.测试和检验这些原型
** 5.基于你已经了解的，提出一个更详细的设计
** 6.回到步骤2  

下面的透镜14,15以及原型制作技巧，都是为了实践这个循环的。

* 透镜14 风险减轻的透镜
** 透镜描述
停止去正面思考你的游戏，开始想游戏的风险：

*** 有哪些因素会阻碍这个游戏变得优秀？

我要批注：当前风险如下：  
1. 性能卡, 前主程导致，幸亏田老师正在修正，风险正在减少。

2. 数值设定不合理，这是某大神水平差造成的，现在正在修正。

3. 玩家体验很差，这个我来主抓。

4. 存在漏洞，被玩家利用，造成各种不公平或者不可接受的情形出现。

5. 收费不成系统。这个有人在主抓，向先进游戏学习。

6. 玩法单薄，没啥可玩的。

*** 如何能阻止这些因素的发生？

1. 技术发力，做好性能优化。

2. 策划发力，做好数值。

3. 狠抓体验。
   
** 原理
《孙子兵法》九变第八：智者之虑，必杂于利害。杂于利而务可信也，
杂于害而患可解也。含义：
明智的将帅考虑问题，总是兼顾到利和害两个方面。在有利的悄况下考虑到不利的方面，事情就可以顺利进行;在不利的情况下考虑到有利的方面，祸患就可以解除。
所以项目一开始，就把可能的风险和不利局面想清楚，找出应对办法。
《找》这个项目，做到了这点，事先分析了各种风险，做到了预先防备，基本顺利。


* 原型制作技巧

** 循环回路

*** 一、陈述问题
*** 二、对一些可能的方案进行头脑风暴
*** 三、选择一种解决方案
*** 四、列出使用这种解决方案的各种风险
*** 五、建立各种原型来减轻这种风险
*** 六、测试这些原型，如果足够好了，就停止
*** 七、陈述你要解决的新问题，回到第2步。


** 高效的原型制作技巧
*** 技巧1 ： 回答一个问题
  每次制作游戏原型，要回答一个到多个问题。
应该清晰地称述这些问题。
把注意力只放在回答好关键问题上，抵制把原型做得过分精致的诱惑。
原型可能回答类似下面的问题：
  我们游戏的核心玩法有趣吗？它能长时间保持有趣吗？
  从美感上来说，我们的角色和背景设定相互符合吗？
  这个游戏需要多少关卡？
*** 技巧2: 忘掉质量
   原型制作是为了回答问题的，所以做出的速度越快越好，不要追求质量。
   你绕不开循环原则，所以越快进行循环，越好。
*** 技巧3: 别对它太依恋
   这是原型，所以它的意义在于回答问题，其余皆可抛弃。
*** 区分优先级
   消除风险的时候，可能面临多个风险。要分析这些风险，第一时间处理最大的风险。
*** 并行开发原型
   美术和技术可以并行进行原型开发。
*** 并非一定是电子版本的
   可以制作简单的桌面游戏原型
*** 选择快速游戏制作引擎
   比如python, panda3d之类的
   用它们，能够快速开发出东西，进行测试，再进行开发和调整。
*** 先创造玩具
   先制作出玩具，再制作游戏。


* 透镜15:  玩具的透镜
如果我的游戏没有任何目标，它仍然有趣吗？如果不是这样，那么怎么办？

人们看到我的游戏时，在不知道做什么之前，有和它交互之想法吗？如果没有，怎么办？

* 透镜16 玩家的透镜
游戏是为玩家做的。

爱因斯坦的小提琴的例子：启发：你必须清楚观众喜欢什么，不喜欢什么。
必须用观众能听得懂的术语和方式来表达。

