game_design_notes.html
<div id="outline-container-sec-13-1-2" class="outline-4">
<h4 id="sec-13-1-2"><span class="section-number-4">13.1.2</span> 游戏中的哪些元素是削减这种体验的？</h4>
</div>
<div id="outline-container-sec-13-1-3" class="outline-4">
<h4 id="sec-13-1-3"><span class="section-number-4">13.1.3</span> 如何调整这些元素来改良体验？</h4>
<div class="outline-text-4" id="text-13-1-3">
<p>
  To use this lens, you must see everything in your game at once: the four ele-
ments and the player experience, as well as how they interrelate. It is accepta-
ble to shift your focus from skin to skeleton and back again, but it is far better 
to view your game and experience holographically. 
</p>
</div>
</div>
</div>

<div id="outline-container-sec-13-2" class="outline-3">
<h3 id="sec-13-2"><span class="section-number-3">13.2</span> 扩展描述</h3>
<div class="outline-text-3" id="text-13-2">
<p>
其实，就是从游戏的表面体验到游戏的有机组成两个不同层次、以及它们如何相互作用来来观察游戏、改进游戏的设计。
</p>

<p>
这就是全息设计的本质。
</p>

<p>
游戏的皮肤：游戏体验。
</p>

<p>
游戏的骨骼：组成游戏的各元素。
</p>

<p>
一个可怕的陷阱：一些设计师，一直想着游戏内部运作的细节，但完全忽略了玩家的体验。
</p>

<p>
只关注游戏骨骼，或者只关注游戏的皮肤，都不全面。必须同时关注两个方面。
</p>

<p>
你要把注意力在游戏皮肤和骨骼之间来回切换。
</p>

<p>
*游戏中的哪些元素能使整个体验变得愉悦？
</p>

<p>
界面，语言。
</p>

<p>
*游戏总的哪些元素是削弱这种体验的？
</p>

<p>
冷却，特产，无法让玩家理解的技能。
</p>

<p>
*如何能调整这些游戏元素来改良体验？
</p>

<p>
前n次不需要冷却
</p>

<p>
特产有用化
</p>

<p>
技能简化，表现能力增加，搭配有趣
</p>
</div>
</div>
</div>
<div id="outline-container-sec-14" class="outline-2">
<h2 id="sec-14"><span class="section-number-2">14</span> 9 统一的透镜</h2>
<div class="outline-text-2" id="text-14">
<p>
*我游戏的主题是什么？
</p>

<p>
让玩家轻松搞笑地在明朝混，最终目的是当皇帝。
</p>
</div>

<div id="outline-container-sec-14-1" class="outline-3">
<h3 id="sec-14-1"><span class="section-number-3">14.1</span> 我用了每一种可能的方法去强化这个主题了吗？</h3>
<div class="outline-text-3" id="text-14-1">
<p>
美术方面，用诙谐简单的画面来表现，有一定的效果。
</p>

<p>
玩法方面，玩家从事的事情，有混的感觉。其实当前《大明》还没有强调这个，混的感觉相当淡化。
</p>

<p>
统一的透镜和基本的四元组透镜一起运用是很棒的。先分解，再综合它们为一个主题而服务。
</p>
</div>
</div>
</div>

<div id="outline-container-sec-15" class="outline-2">
<h2 id="sec-15"><span class="section-number-2">15</span> 10 共鸣的透镜</h2>
<div class="outline-text-2" id="text-15">
</div><div id="outline-container-sec-15-1" class="outline-3">
<h3 id="sec-15-1"><span class="section-number-3">15.1</span> 找能引起玩家共鸣的主题。</h3>
<div class="outline-text-3" id="text-15-1">
<p>
我们讨厌那种繁琐和累的武侠RPG，它们太同质化了，没意思。
</p>

<p>
我们工作已经很累了，让我们轻松点好吗？
</p>

<p>
我们看花花绿绿的艳俗游戏界面都厌倦了，想看漫画清新的界面
</p>

<p>
我们需要发自内心的愉悦感。
</p>

<p>
这些都是《大明》能引起共鸣的主题。
</p>
</div>
</div>
</div>
<div id="outline-container-sec-16" class="outline-2">
<h2 id="sec-16"><span class="section-number-2">16</span> 12 问题陈述的透镜</h2>
<div class="outline-text-2" id="text-16">
<p>
把你的游戏看成是对某个问题的解决方案
</p>
</div>

<div id="outline-container-sec-16-1" class="outline-3">
<h3 id="sec-16-1"><span class="section-number-3">16.1</span> 我到底在解决哪种问题呢？</h3>
<div class="outline-text-3" id="text-16-1">
<p>
武侠RPG很累的模式
</p>

<p>
游戏越做越雷同的方式
</p>
</div>
</div>
<div id="outline-container-sec-16-2" class="outline-3">
<h3 id="sec-16-2"><span class="section-number-3">16.2</span> 游戏真的是这个问题的最佳解决方案吗？为什么？</h3>
<div class="outline-text-3" id="text-16-2">
<p>
是的
</p>
</div>
</div>
<div id="outline-container-sec-16-3" class="outline-3">
<h3 id="sec-16-3"><span class="section-number-3">16.3</span> 我如何知道问题是否解决了呢？</h3>
<div class="outline-text-3" id="text-16-3">
<p>
当《大明》开始口碑传播。
</p>
</div>
</div>
</div>
<div id="outline-container-sec-17" class="outline-2">
<h2 id="sec-17"><span class="section-number-2">17</span> 筛选创意的八个步子</h2>
<div class="outline-text-2" id="text-17">
</div><div id="outline-container-sec-17-1" class="outline-3">
<h3 id="sec-17-1"><span class="section-number-3">17.1</span> 1. 美感上的刺激。</h3>
<div class="outline-text-3" id="text-17-1">
<p>
这个游戏感觉对头吗？
</p>
</div>
</div>

<div id="outline-container-sec-17-2" class="outline-3">
<h3 id="sec-17-2"><span class="section-number-3">17.2</span> 2.受众的统计数据</h3>
<div class="outline-text-3" id="text-17-2">
<p>
目标受众会足够喜欢这个游戏吗？
</p>
</div>
</div>

<div id="outline-container-sec-17-3" class="outline-3">
<h3 id="sec-17-3"><span class="section-number-3">17.3</span> 3. 体验设计</h3>
<div class="outline-text-3" id="text-17-3">
<p>
把你所知道的能用来创造一种出色的体验的所有东西都考虑进去，包括美感，兴趣曲线，共鸣的主题，游戏平衡，以及其他。
这是一个良好设计的游戏吗？
</p>
</div>
</div>

<div id="outline-container-sec-17-4" class="outline-3">
<h3 id="sec-17-4"><span class="section-number-3">17.4</span> 4. 创新</h3>
<div class="outline-text-3" id="text-17-4">
<p>
给玩家一些从来没有见过的东西.
</p>

<p>
这个游戏足够新颖吗？
</p>
</div>
</div>
<div id="outline-container-sec-17-5" class="outline-3">
<h3 id="sec-17-5"><span class="section-number-3">17.5</span> 5.商业和市场营销</h3>
<div class="outline-text-3" id="text-17-5">
<p>
这个游戏能卖得火吗？
</p>
</div>
</div>

<div id="outline-container-sec-17-6" class="outline-3">
<h3 id="sec-17-6"><span class="section-number-3">17.6</span> 6.技术角度</h3>
<div class="outline-text-3" id="text-17-6">
<p>
这个游戏在技术上有可能作出来吗？
</p>
</div>
</div>

<div id="outline-container-sec-17-7" class="outline-3">
<h3 id="sec-17-7"><span class="section-number-3">17.7</span> 7.社会/社区角度</h3>
<div class="outline-text-3" id="text-17-7">
<p>
这个游戏满足我们社会上的目标吗？
</p>
</div>
</div>

<div id="outline-container-sec-17-8" class="outline-3">
<h3 id="sec-17-8"><span class="section-number-3">17.8</span> 8.游戏测试</h3>
<div class="outline-text-3" id="text-17-8">
<p>
参加游戏测试的入足够喜欢这个游戏吗？
</p>
</div>
</div>
</div>

<div id="outline-container-sec-18" class="outline-2">
<h2 id="sec-18"><span class="section-number-2">18</span> 透镜13 八滤镜的透镜</h2>
<div class="outline-text-2" id="text-18">
<p>
你的设计必须满足众多的约束，只有当它无需再进行修改地通过了所有的八个滤镜时，你才能声称你的设计是最终成型的。
+这个游戏感觉对头吗？
+目标受众足够喜欢这个游戏吗？
+这是一个良好设计的游戏吗？
  我要批注  废话，什么叫“良好设计”的？如何量化和可评估呢？
+这个游戏足够新颖吗？
  我要批注  不错，挺新的。
+这个游戏会卖得火吗？
+这个游戏在技术上有可能做得出来吗？
+这个游戏满足我们社会上和社区上的目标吗？
我要批注  这是什么意思呢？
+参与测试的人，足够喜欢这个游戏吗？
我要批注  还好，有4%的人喜欢，而且成为了fans
</p>
</div>
</div>
<div id="outline-container-sec-19" class="outline-2">
<h2 id="sec-19"><span class="section-number-2">19</span> 游戏开发中的循环技术</h2>
<div class="outline-text-2" id="text-19">
</div><div id="outline-container-sec-19-1" class="outline-3">
<h3 id="sec-19-1"><span class="section-number-3">19.1</span> 1.提出一个基础设计</h3>
</div>
<div id="outline-container-sec-19-2" class="outline-3">
<h3 id="sec-19-2"><span class="section-number-3">19.2</span> 2.找出设计中最大的风险</h3>
</div>
<div id="outline-container-sec-19-3" class="outline-3">
<h3 id="sec-19-3"><span class="section-number-3">19.3</span> 3.建立各种原型来减轻这些风险</h3>
</div>
<div id="outline-container-sec-19-4" class="outline-3">
<h3 id="sec-19-4"><span class="section-number-3">19.4</span> 4.测试和检验这些原型</h3>
</div>
<div id="outline-container-sec-19-5" class="outline-3">
<h3 id="sec-19-5"><span class="section-number-3">19.5</span> 5.基于你已经了解的，提出一个更详细的设计</h3>
</div>
<div id="outline-container-sec-19-6" class="outline-3">
<h3 id="sec-19-6"><span class="section-number-3">19.6</span> 6.回到步骤2</h3>
<div class="outline-text-3" id="text-19-6">
<p>
下面的透镜14,15以及原型制作技巧，都是为了实践这个循环的。
</p>
</div>
</div>
</div>
<div id="outline-container-sec-20" class="outline-2">
<h2 id="sec-20"><span class="section-number-2">20</span> 透镜14 风险减轻的透镜</h2>
<div class="outline-text-2" id="text-20">
</div><div id="outline-container-sec-20-1" class="outline-3">
<h3 id="sec-20-1"><span class="section-number-3">20.1</span> 透镜描述</h3>
<div class="outline-text-3" id="text-20-1">
<p>
停止去正面思考你的游戏，开始想游戏的风险：
</p>
</div>

<div id="outline-container-sec-20-1-1" class="outline-4">
<h4 id="sec-20-1-1"><span class="section-number-4">20.1.1</span> 有哪些因素会阻碍这个游戏变得优秀？</h4>
<div class="outline-text-4" id="text-20-1-1">
<p>
我要批注：当前风险如下：  
</p>
<ol class="org-ol">
<li>性能卡, 前主程导致，幸亏田老师正在修正，风险正在减少。
</li>

<li>数值设定不合理，这是某大神水平差造成的，现在正在修正。
</li>

<li>玩家体验很差，这个我来主抓。
</li>

<li>存在漏洞，被玩家利用，造成各种不公平或者不可接受的情形出现。
</li>

<li>收费不成系统。这个有人在主抓，向先进游戏学习。
</li>

<li>玩法单薄，没啥可玩的。
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-20-1-2" class="outline-4">
<h4 id="sec-20-1-2"><span class="section-number-4">20.1.2</span> 如何能阻止这些因素的发生？</h4>
<div class="outline-text-4" id="text-20-1-2">
<ol class="org-ol">
<li>技术发力，做好性能优化。
</li>

<li>策划发力，做好数值。
</li>

<li>狠抓体验。
</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-sec-20-2" class="outline-3">
<h3 id="sec-20-2"><span class="section-number-3">20.2</span> 原理</h3>
<div class="outline-text-3" id="text-20-2">
<p>
《孙子兵法》九变第八：智者之虑，必杂于利害。杂于利而务可信也，
杂于害而患可解也。含义：
明智的将帅考虑问题，总是兼顾到利和害两个方面。在有利的悄况下考虑到不利的方面，事情就可以顺利进行;在不利的情况下考虑到有利的方面，祸患就可以解除。
所以项目一开始，就把可能的风险和不利局面想清楚，找出应对办法。
《找》这个项目，做到了这点，事先分析了各种风险，做到了预先防备，基本顺利。
</p>
</div>
</div>
</div>

<div id="outline-container-sec-21" class="outline-2">
<h2 id="sec-21"><span class="section-number-2">21</span> 原型制作技巧</h2>
<div class="outline-text-2" id="text-21">
</div><div id="outline-container-sec-21-1" class="outline-3">
<h3 id="sec-21-1"><span class="section-number-3">21.1</span> 循环回路</h3>
<div class="outline-text-3" id="text-21-1">
</div><div id="outline-container-sec-21-1-1" class="outline-4">
<h4 id="sec-21-1-1"><span class="section-number-4">21.1.1</span> 一、陈述问题</h4>
</div>
<div id="outline-container-sec-21-1-2" class="outline-4">
<h4 id="sec-21-1-2"><span class="section-number-4">21.1.2</span> 二、对一些可能的方案进行头脑风暴</h4>
</div>
<div id="outline-container-sec-21-1-3" class="outline-4">
<h4 id="sec-21-1-3"><span class="section-number-4">21.1.3</span> 三、选择一种解决方案</h4>
</div>
<div id="outline-container-sec-21-1-4" class="outline-4">
<h4 id="sec-21-1-4"><span class="section-number-4">21.1.4</span> 四、列出使用这种解决方案的各种风险</h4>
</div>
<div id="outline-container-sec-21-1-5" class="outline-4">
<h4 id="sec-21-1-5"><span class="section-number-4">21.1.5</span> 五、建立各种原型来减轻这种风险</h4>
</div>
<div id="outline-container-sec-21-1-6" class="outline-4">
<h4 id="sec-21-1-6"><span class="section-number-4">21.1.6</span> 六、测试这些原型，如果足够好了，就停止</h4>
</div>
<div id="outline-container-sec-21-1-7" class="outline-4">
<h4 id="sec-21-1-7"><span class="section-number-4">21.1.7</span> 七、陈述你要解决的新问题，回到第2步。</h4>
</div>
</div>

<div id="outline-container-sec-21-2" class="outline-3">
<h3 id="sec-21-2"><span class="section-number-3">21.2</span> 高效的原型制作技巧</h3>
<div class="outline-text-3" id="text-21-2">
</div><div id="outline-container-sec-21-2-1" class="outline-4">
<h4 id="sec-21-2-1"><span class="section-number-4">21.2.1</span> 技巧1 ： 回答一个问题</h4>
<div class="outline-text-4" id="text-21-2-1">
<p>
  每次制作游戏原型，要回答一个到多个问题。
应该清晰地称述这些问题。
把注意力只放在回答好关键问题上，抵制把原型做得过分精致的诱惑。
原型可能回答类似下面的问题：
  我们游戏的核心玩法有趣吗？它能长时间保持有趣吗？
  从美感上来说，我们的角色和背景设定相互符合吗？
  这个游戏需要多少关卡？
</p>
</div>
</div>

<div id="outline-container-sec-21-2-2" class="outline-4">
<h4 id="sec-21-2-2"><span class="section-number-4">21.2.2</span> 技巧2: 忘掉质量</h4>
<div class="outline-text-4" id="text-21-2-2">
<p>
原型制作是为了回答问题的，所以做出的速度越快越好，不要追求质量。
你绕不开循环原则，所以越快进行循环，越好。
</p>
</div>
</div>

<div id="outline-container-sec-21-2-3" class="outline-4">
<h4 id="sec-21-2-3"><span class="section-number-4">21.2.3</span> 技巧3: 别对它太依恋</h4>
<div class="outline-text-4" id="text-21-2-3">
<p>
这是原型，所以它的意义在于回答问题，其余皆可抛弃。
</p>
</div>
</div>

<div id="outline-container-sec-21-2-4" class="outline-4">
<h4 id="sec-21-2-4"><span class="section-number-4">21.2.4</span> 区分优先级</h4>
<div class="outline-text-4" id="text-21-2-4">
<p>
消除风险的时候，可能面临多个风险。要分析这些风险，第一时间处理最大的风险。
</p>
</div>
</div>

<div id="outline-container-sec-21-2-5" class="outline-4">
<h4 id="sec-21-2-5"><span class="section-number-4">21.2.5</span> 并行开发原型</h4>
<div class="outline-text-4" id="text-21-2-5">
<p>
美术和技术可以并行进行原型开发。
</p>
</div>
</div>

<div id="outline-container-sec-21-2-6" class="outline-4">
<h4 id="sec-21-2-6"><span class="section-number-4">21.2.6</span> 并非一定是电子版本的</h4>
<div class="outline-text-4" id="text-21-2-6">
<p>
可以制作简单的桌面游戏原型
</p>
</div>
</div>

<div id="outline-container-sec-21-2-7" class="outline-4">
<h4 id="sec-21-2-7"><span class="section-number-4">21.2.7</span> 选择快速游戏制作引擎</h4>
<div class="outline-text-4" id="text-21-2-7">
<p>
比如python, panda3d之类的
用它们，能够快速开发出东西，进行测试，再进行开发和调整。
</p>
</div>
</div>

<div id="outline-container-sec-21-2-8" class="outline-4">
<h4 id="sec-21-2-8"><span class="section-number-4">21.2.8</span> 先创造玩具</h4>
<div class="outline-text-4" id="text-21-2-8">
<p>
先制作出玩具，再制作游戏。
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-22" class="outline-2">
<h2 id="sec-22"><span class="section-number-2">22</span> 透镜15:  玩具的透镜</h2>
<div class="outline-text-2" id="text-22">
<p>
如果我的游戏没有任何目标，它仍然有趣吗？如果不是这样，那么怎么办？
</p>

<p>
人们看到我的游戏时，在不知道做什么之前，有和它交互之想法吗？如果没有，怎么办？
</p>
</div>
</div>
<div id="outline-container-sec-23" class="outline-2">
<h2 id="sec-23"><span class="section-number-2">23</span> 透镜16 玩家的透镜</h2>
<div class="outline-text-2" id="text-23">
<p>
游戏是为玩家做的。
</p>

<p>
爱因斯坦的小提琴的例子：启发：你必须清楚观众喜欢什么，不喜欢什么。
必须用观众能听得懂的术语和方式来表达。
</p>
</div>
