game_design_notes.html

<div id="outline-container-sec-23-1" class="outline-3">
<h3 id="sec-23-1"><span class="section-number-3">23.1</span> 透镜描述</h3>
<div class="outline-text-3" id="text-23-1">
<p>
用Ainstian给主要是老妇人组成的观众拉小提琴来说明：了解你的观众很重要！这些人不是为了听讲课，而是为了和著名的物理学家亲密接触。
</p>

<p>
要想打造出绝好的体验，我们必须效仿爱因斯坦。你必须清楚你的观众喜欢什么，不喜欢什么，你甚至必须比它们自己还要了解它们。做到这一点的秘籍，
在于倾听。你必须透彻且深入地倾听你的玩家，你必须紧密地和它们的思想、感情、恐惧和欲望连接在一起。
</p>

<p>
要设身处地，利用你的移情力量把自己置身于它们的位置上。
</p>

<p>
停止思考你的游戏，开始思考你的玩家
问下面的问题来了解那些玩你游戏的人：
</p>
<ol class="org-ol">
<li>通常来说它们喜欢什么？
</li>
<li>他们不喜欢什么，为什么？
</li>
<li>他们期望在游戏中看到什么？
</li>
<li>如果我站在他们的位置，我想在游戏中看到什么？
</li>
<li>特别来说，他们喜欢和不喜欢我游戏中的哪些部分？
</li>
</ol>

<p>
一个优秀的游戏设计师，应该重视去思考玩家，他应该是玩家的拥护者。
</p>

<p>
技巧熟练的设计师会同时把玩家的透镜和全息设计的透镜拿在手上，不断地对玩家、游戏体验，以及游戏中的各自机制进行同时的思考。
</p>

<p>
思考玩家的过程是很有用的，但更有用的是观察它们玩你的游戏的过程。你越多地观察它们玩游戏的过程，你就越容易地预测到她们喜欢什么。
</p>
</div>
</div>
<div id="outline-container-sec-23-2" class="outline-3">
<h3 id="sec-23-2"><span class="section-number-3">23.2</span> 扩展描述</h3>
<div class="outline-text-3" id="text-23-2">
<p>
巴图的玩家类型分类法
</p>

<ol class="org-ol">
<li>成就型玩家  想要达成游戏中的各种目标，它们主要快乐来源是挑战
</li>
</ol>

<p>
2.探索型玩家 想要了解游戏的方方面面，快乐来源于发现
</p>

<ol class="org-ol">
<li>社交玩家 对人与人的关系很感兴趣
</li>
</ol>

<p>
4 杀手型玩家 对击败别人以及与别人竞技感兴趣，感兴趣于对别人施加影响
</p>

<p>
外加一个：脑残类玩家，只是在地铁上随手打发下时间，适合手机游戏休闲类型。
</p>
</div>

<div id="outline-container-sec-23-2-1" class="outline-4">
<h4 id="sec-23-2-1"><span class="section-number-4">23.2.1</span> 我要批注</h4>
<div class="outline-text-4" id="text-23-2-1">
<p>
对于成就类型玩家，我们游戏有成就系统，满足他们。
对于探索类型玩家，我们游戏有隐藏地点，满足他们。外加推图模式，也是探索的一种。
对于社交类型玩家，我们设计了四种类别的玩家关系，以及帮会系统，来满足他们。
对于杀手类型玩家，我们设计了PK系统和通缉系统，以及PK威望这种数值，来满足他们。
</p>
</div>
</div>
</div>
<div id="outline-container-sec-23-3" class="outline-3">
<h3 id="sec-23-3"><span class="section-number-3">23.3</span> 女人在游戏中喜欢的：</h3>
<div class="outline-text-3" id="text-23-3">
</div><div id="outline-container-sec-23-3-1" class="outline-4">
<h4 id="sec-23-3-1"><span class="section-number-4">23.3.1</span> 情感。</h4>
</div>
<div id="outline-container-sec-23-3-2" class="outline-4">
<h4 id="sec-23-3-2"><span class="section-number-4">23.3.2</span> 现实世界</h4>
</div>
<div id="outline-container-sec-23-3-3" class="outline-4">
<h4 id="sec-23-3-3"><span class="section-number-4">23.3.3</span> 养育</h4>
</div>
<div id="outline-container-sec-23-3-4" class="outline-4">
<h4 id="sec-23-3-4"><span class="section-number-4">23.3.4</span> 对话和迷题</h4>
</div>
<div id="outline-container-sec-23-3-5" class="outline-4">
<h4 id="sec-23-3-5"><span class="section-number-4">23.3.5</span> 通过例子来学习</h4>
</div>
</div>

<div id="outline-container-sec-23-4" class="outline-3">
<h3 id="sec-23-4"><span class="section-number-3">23.4</span> 男人在游戏中喜欢的：</h3>
<div class="outline-text-3" id="text-23-4">
</div><div id="outline-container-sec-23-4-1" class="outline-4">
<h4 id="sec-23-4-1"><span class="section-number-4">23.4.1</span> 掌握。</h4>
</div>
<div id="outline-container-sec-23-4-2" class="outline-4">
<h4 id="sec-23-4-2"><span class="section-number-4">23.4.2</span> 竞技</h4>
</div>
<div id="outline-container-sec-23-4-3" class="outline-4">
<h4 id="sec-23-4-3"><span class="section-number-4">23.4.3</span> 破坏</h4>
</div>
<div id="outline-container-sec-23-4-4" class="outline-4">
<h4 id="sec-23-4-4"><span class="section-number-4">23.4.4</span> 空间性迷题</h4>
</div>
<div id="outline-container-sec-23-4-5" class="outline-4">
<h4 id="sec-23-4-5"><span class="section-number-4">23.4.5</span> 反复试验</h4>
</div>
</div>
</div>



<div id="outline-container-sec-24" class="outline-2">
<h2 id="sec-24"><span class="section-number-2">24</span> 透镜#17 快乐的透镜</h2>
<div class="outline-text-2" id="text-24">
<p>
在使用这个透镜的时候，思考你的游戏已经提供的还没有提供的各类快乐
问问题：
</p>

<p>
你的游戏给予玩家哪些快乐？这些玩家快乐可以进一步加强吗？
</p>

<p>
哪些快乐是你的体验中遗漏的？为什么？能把它们加回来吗？
</p>

<p>
快乐：
</p>

<p>
预感
</p>

<p>
幸灾乐祸
</p>

<p>
给予礼物
</p>

<p>
幽默
</p>

<p>
可能性
</p>

<p>
成就的自豪
</p>

<p>
净化&#x2013;吃光所有的豆-&#x2014;&#x2014;消除！！
</p>

<p>
惊喜 &#x2013;大脑喜欢各种惊喜
</p>

<p>
刺激
</p>

<p>
战胜逆境
</p>

<p>
好奇
</p>


<p>
人对人的信息，存了很多脸部和头部的，所以我们接受漫画中非常夸张的大头。
</p>

<p>
线条：完美地匹配了我们内部的建模机制，并且帮它们省去不少工作。为什么动漫看起来赏心悦目？因为我们的
</p>

<p>
大脑在理解事物的时候喜欢那些只需更少工作的。
</p>

<p>
作为游戏设计师，我们需要对这些心智模型更多加关心。因为有着简单规则的游戏就像漫画人物一样，
</p>

<p>
它们是我们容易接受和处理的预先消化过的模型。正因为这个原因让
</p>

<p>
它们玩起来感觉很放松，因为相比现实世界，它们只需我们大脑做更少的工作就能处理了，
</p>

<p>
其余的大部分复杂性早已从里面剥离。
</p>

<p>
flow的关键
一、清晰的目标。目标清晰，更容易聚焦到手头的任务上。
二、聚焦，专注，不被分心。
三、直接的反馈（立刻的反馈）。采取行动后，立刻有结果。
四、持续不断的挑战。挑战太难，人就有挫败感，人会转向选择别的感觉值得做的事情做。挑战太容易，让人感觉太无聊，人也会再次选择值得做的事情。
</p>

<p>
我要批注  过关通道的设计，达到了上面四点，还不错。
</p>
</div>
</div>

<div id="outline-container-sec-25" class="outline-2">
<h2 id="sec-25"><span class="section-number-2">25</span> 透镜#18 心流的透镜</h2>
<div class="outline-text-2" id="text-25">
</div><div id="outline-container-sec-25-1" class="outline-3">
<h3 id="sec-25-1"><span class="section-number-3">25.1</span> 透镜描述</h3>
<div class="outline-text-3" id="text-25-1">
<p>
其实就是心理学家那个flow模型。
</p>

<p>
  思考一下，什么吸引你的玩家聚焦在游戏中的。
问自己这些问题：
</p>
<ol class="org-ol">
<li>我的游戏有清晰的目标吗？如果没有，如何修正这个问题呢？
</li>
<li>玩家在游戏中的目标和我预期的目标一致吗？
</li>
<li>游戏中有哪些让玩家分心，乃至忘记了目标？ 如有，如何减少这些分心因素，或者把它们关系到游戏目标上。
</li>
<li>我考虑了玩家水平会逐步提升，而提供了稳定的、不容易、但也不太难的挑战了吗？
</li>
<li>玩家提升技巧的速度，是我希望的速度吗？如果不是这样，我如何改变之？
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-25-2" class="outline-3">
<h3 id="sec-25-2"><span class="section-number-3">25.2</span> 扩展描述</h3>
<div class="outline-text-3" id="text-25-2">
<p>
对游戏设计师来说，研究心流是很值得的。
产生一种行为，并把玩家推向心流的一部分关键因素如下：
</p>
<ol class="org-ol">
<li>清晰的目标。
</li>
</ol>
<p>
  目标越清晰，越能持续聚焦在手头的任务上。
我要批注  现在提供了较为清晰的目标：去广州救父亲，去福州得到自己的皇族玉佩
</p>
<ol class="org-ol">
<li>没有被分心。
</li>
</ol>
<p>
  分心会偷走聚焦，没有聚焦就没有心流。
我要批注  什么让我的游戏有分心？
</p>
<ol class="org-ol">
<li>直接的反馈。
</li>
</ol>
<p>
  立刻给出反馈，能保持聚焦。
我要批注  现在打副本，有马上显示“过关进度 65%", 这就是直接的反馈。
</p>
<ol class="org-ol">
<li>持续不断的挑战
</li>
</ol>
<p>
  人喜欢挑战。但它必须是能达到的，而且不能无聊。
我要批注  过关通道就是持续不断的挑战。
</p>
</div>
</div>
<div id="outline-container-sec-25-3" class="outline-3">
<h3 id="sec-25-3"><span class="section-number-3">25.3</span> 分析：《北浮》提供了心流</h3>
<div class="outline-text-3" id="text-25-3">
</div><div id="outline-container-sec-25-3-1" class="outline-4">
<h4 id="sec-25-3-1"><span class="section-number-4">25.3.1</span> 一、玩家有清晰的目标：赚钱，钱越多越好。</h4>
<div class="outline-text-4" id="text-25-3-1">
<p>
玩家还有眼前的目标：赶快给村长还钱，这个目标是当下的，不完成就会被村长打死，结束游戏。
</p>
</div>
</div>

<div id="outline-container-sec-25-3-2" class="outline-4">
<h4 id="sec-25-3-2"><span class="section-number-4">25.3.2</span> 二、没有被分心</h4>
<div class="outline-text-4" id="text-25-3-2">
<p>
玩家没有别的不相关的事情分散精力。北浮整个游戏很简单，各种功能都是围绕“赚钱”这个核心点的。
</p>
</div>
</div>

<div id="outline-container-sec-25-3-3" class="outline-4">
<h4 id="sec-25-3-3"><span class="section-number-4">25.3.3</span> 三、直接的反馈</h4>
<div class="outline-text-4" id="text-25-3-3">
<p>
玩家的倒卖行动，能立刻看到结果，赚了还是赔了。
</p>
</div>
</div>

<div id="outline-container-sec-25-3-4" class="outline-4">
<h4 id="sec-25-3-4"><span class="section-number-4">25.3.4</span> 四、持续不断的挑战</h4>
<div class="outline-text-4" id="text-25-3-4">
<p>
游戏中，玩家先倒卖小物品，然后倒卖大物品（汽车），挑战是持续不断的。
</p>
</div>
</div>
</div>

<div id="outline-container-sec-25-4" class="outline-3">
<h3 id="sec-25-4"><span class="section-number-3">25.4</span> 分析：《糖果》提供了心流</h3>
<div class="outline-text-3" id="text-25-4">
</div><div id="outline-container-sec-25-4-1" class="outline-4">
<h4 id="sec-25-4-1"><span class="section-number-4">25.4.1</span> 1. 玩家有清晰的目标：过眼前这关，然后下一关，以至于地图上的300多关。</h4>
</div>
<div id="outline-container-sec-25-4-2" class="outline-4">
<h4 id="sec-25-4-2"><span class="section-number-4">25.4.2</span> 2. 没有被分心</h4>
<div class="outline-text-4" id="text-25-4-2">
<p>
因为玩法聚焦于地图上单线关卡串，没有别的东西让玩家分心。
</p>
</div>
</div>

<div id="outline-container-sec-25-4-3" class="outline-4">
<h4 id="sec-25-4-3"><span class="section-number-4">25.4.3</span> 3. 直接的反馈</h4>
<div class="outline-text-4" id="text-25-4-3">
<p>
玩家每个动作（移动糖果），都有反馈。
</p>
</div>
</div>

<div id="outline-container-sec-25-4-4" class="outline-4">
<h4 id="sec-25-4-4"><span class="section-number-4">25.4.4</span> 4. 持续不断的挑战</h4>
<div class="outline-text-4" id="text-25-4-4">
<p>
地图上漫长而持续的关卡，不仅难度逐步增加，而且玩法也逐步多样化，给玩家提供了持续不断的挑战。
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-26" class="outline-2">
<h2 id="sec-26"><span class="section-number-2">26</span> 透镜#19 需求的透镜</h2>
<div class="outline-text-2" id="text-26">
<p>
停止思考游戏，思考它满足了人们什么需求。
</p>

<p>
&lt;找你妹》满足了女性“找”的需求。
&lt;找你妹》满足了N多人要一个简单的打发时间的需求。
</p>
</div>
</div>
<div id="outline-container-sec-27" class="outline-2">
<h2 id="sec-27"><span class="section-number-2">27</span> 透镜#20 评判的透镜</h2>
<div class="outline-text-2" id="text-27">
</div><div id="outline-container-sec-27-1" class="outline-3">
<h3 id="sec-27-1"><span class="section-number-3">27.1</span> 透镜描述</h3>
<div class="outline-text-3" id="text-27-1">
<p>
在确定你的游戏是否对玩家进行了良好的评判时，问一下自己下面的问题：
</p>
</div>

<ol class="org-ol"><li>我的游戏会评判玩家哪些方面呢？<br/></li>
<li>它是如何传达这种评判的？<br/></li>
<li>玩家感觉这种评判公正吗？<br/></li>
<li>玩家在乎这种评判吗？<br/></li>
<li>这些评判让玩家有自我提升的欲望吗？<br/></li></ol>
</div>
<div id="outline-container-sec-27-2" class="outline-3">
<h3 id="sec-27-2"><span class="section-number-3">27.2</span> 扩展描述</h3>
<div class="outline-text-3" id="text-27-2">
<p>
在马洛斯需求体系的第四层，自尊心是和游戏有着最密切关联的。为什么呢？所有人一个深层次而且常见的需求是被评判。
我们内心深处都想了解自己是处于何种状态的。
事实上游戏是有目的地评判的绝好系统，这点也是它们最吸引人的特色之一。
</p>
</div>
</div>

<div id="outline-container-sec-27-3" class="outline-3">
<h3 id="sec-27-3"><span class="section-number-3">27.3</span> 应用</h3>
<div class="outline-text-3" id="text-27-3">
</div><ol class="org-ol"><li>我的游戏会评判玩家哪些方面呢？<br/><ol class="org-ol"><li>玩家传统RPG那一套的评价体系。&#x2013;&#x2014;俗气，无特点。<br/></li>
<li>玩家非传统的一套：<br/><ol class="org-ol"><li>混世技能，评价了玩家混世的方方面面。这个能带来一些乐趣。<br/></li>
<li>成就系统，评价了玩家在游戏中的各种表现。这个带来追求。<br/></li>
<li>称号系统？评价玩家比较变态的成就？<br/></li></ol>
</li></ol>
</li>
<li>它是如何传达这种评判的？<br/><ol class="org-ol"><li>通过排行和数值。是否还有更好的方法呢？<br/></li>
<li>通过称号？<br/></li></ol>
</li>

<li>玩家感觉这种评判公正吗？<br/><ol class="org-ol"><li>不知道啊。<br/></li></ol>
</li>

<li>玩家在乎这种评判吗？<br/><ol class="org-ol"><li>不知道啊。<br/></li></ol>
</li>

<li>这些评判让玩家有自我提升的欲望吗？<br/><ol class="org-ol"><li>应该有。<br/></li></ol>
</li></ol>
</div>
</div>
<div id="outline-container-sec-28" class="outline-2">
<h2 id="sec-28"><span class="section-number-2">28</span> 透镜#21 功能空间的透镜</h2>
<div class="outline-text-2" id="text-28">
<p>
当游戏所有表面元素都被抽取之后，游戏是在什么空间中发生的。
</p>
</div>

<div id="outline-container-sec-28-1" class="outline-3">
<h3 id="sec-28-1"><span class="section-number-3">28.1</span> 透镜描述</h3>
<div class="outline-text-3" id="text-28-1">
<p>
游戏空间是分离的还是连续的？
空间有多少个维度呢？
这个空间的边界是什么？
空间中有子空间吗？它们是如何关联的？
在抽象出这个游戏的空间时，有别的更有用的视角吗？
</p>
</div>
</div>

<div id="outline-container-sec-28-2" class="outline-3">
<h3 id="sec-28-2"><span class="section-number-3">28.2</span> 扩展</h3>
</div>
<div id="outline-container-sec-28-3" class="outline-3">
<h3 id="sec-28-3"><span class="section-number-3">28.3</span> 应用</h3>
</div>
</div>

<div id="outline-container-sec-29" class="outline-2">
<h2 id="sec-29"><span class="section-number-2">29</span> 透镜#22 动态状态的透镜</h2>
<div class="outline-text-2" id="text-29">
</div><div id="outline-container-sec-29-1" class="outline-3">
<h3 id="sec-29-1"><span class="section-number-3">29.1</span> 透镜描述</h3>
<div class="outline-text-3" id="text-29-1">
<p>
想想你游戏中哪些信息会改变，而且想一想，哪些人会知晓这些改变。问：
在我游戏中有哪些对象？
这些对象有着哪些属性？
每种属性有着哪些可能的状态？是什么触发了这些属性状态的改变？
哪些状态是只有游戏知情的？
哪些状态是所有玩家知情的？
哪些状态是只有一部分玩家或者一个玩家知情的？
改变游戏中对状态的知情关系，能在某种程度上改良我的游戏吗？
</p>
</div>
</div>

<div id="outline-container-sec-29-2" class="outline-3">
<h3 id="sec-29-2"><span class="section-number-3">29.2</span> 扩展描述</h3>
<div class="outline-text-3" id="text-29-2">
<p>
  玩游戏的过程，是决策的过程，而决策过程是基于信息的。确定出不同的属性和其状态，以及哪些人知道这些状态，是
你游戏机制的核心。
  对信息知情者的一点点改变，有时能从根本上改变游戏。
  一个戏剧化的做法是，让所有私秘的信息突然变得公开了。
</p>
</div>
</div>

<div id="outline-container-sec-29-3" class="outline-3">
<h3 id="sec-29-3"><span class="section-number-3">29.3</span> 应用</h3>
<div class="outline-text-3" id="text-29-3">
<p>
在明朝中，你看不到别的玩家的重要信息（例如攻击力，装备等），除非你是他的好友。
知情者体系图：玩家ABC， 有A自己知道的信息，有AB知道的信息，有AC知道的信息等。有大家都知道的信息，有只有游戏知道的信息等等。
</p>
</div>
</div>
</div>
