game_design_notes.org
** 透镜描述
为了确保你的游戏中有各种有趣的自发性特征，问一下自己下面的问题：
**** 我的玩家能拥有多少种动词？
**** 每种动词作用的对象有多少？
**** 玩家能够通过多少种方法达成他们的目标？
**** 玩家能够控制的主语有多少种？
**** 各种副作用是如何改变约束关系的？

** 扩展描述
这是对行为这种机制的描述。
行为是游戏机制中的“动词”。
有两种动词：
一、操作性行为，玩家能采取的基础行为。
二、因而发生的行为，需要从高层次上去观察。他们是与玩家如何利用这些操作性行为达成目标相关的。它包含了游戏中微妙的交互方式，而且通常来说策略性很重。
这些大多数本质上不是规则的一部分，而是在玩游戏的过程中自然产生的行为和策略。
大多数游戏设计师认同，这些有趣的因而发生的行为是一个好游戏的标志。
p=因而发生的行为/操作性行为, p数值越高，游戏越有趣和有深度。
努力去创造因而发生的行为，就像管理你的花园一样，因而发生的行为是有自己生命力的，同时也是脆弱和容易被破坏的。
如果你发现了一些有趣的结果导向的行为时，要认出它们并培养它们。
但如何让它们出现呢？
下面5方法能帮助你为游戏准备好土壤并散播下自发性的种子：
1. 添加更多的动词。也就是，添加更多的操作性行为。因而行为都市在操作性行为对各种对象以及对游戏空间进行相互交互时出现的。当你添加更多的操作性行为后，交互的机会也就变多了，
从而也让自发行为更多地出现。但是，添加太多的操作性动作---尤其是那些不会相互交互的行为，会让游戏臃肿杂乱。因此，添加一个好的操作行为比专家一堆一般
行为要效果好。
2. 能作用到多种对象上的动词。这也许是造就一个简洁、优雅、有趣的游戏最强有力的武器了。
3. 能够用多于一种的方法达成目标，就造成了极为丰富的动态游戏过程，让各种事情成为可能。但这种方式呢，会带来游戏平衡性问题。
4. 多个主语。
  自发性的行为看来粗等于=主语x动词x对象。
  因此，增加主语，很有可能增加自发性行为。
5. 会改变约束条件的副作用效果。
  每当你采取一个行动，它所带来的副作用都会改变你自己或你的对手的约束情况，那是很有趣的。
  例子：
  在跳棋中，你移动一个旗子，你不但改变了你可能被吃掉的格局，还改变了你对手（以及你自己）可以移动的格局。在这个意义上，
  每一步都改变了游戏空间的本质，无论这种改变是你希望或者不希望的。
  通过迫使游戏何种的多个因素在每个操作行为中发生改变，你有很大的可能性能促使各种有趣的自发性行为突出在游戏里出现。
我要批注  中国象棋、围棋、国际象棋，都是如此，动一个旗子，就会导致游戏空1. 全部都提示，则玩家太多
2. 只有少数被提示，就不会消息狂涨，但又有这类消息出现。不然，消息很单一，无法营造气氛间的改变（自己或对方的状态都变化），而玩家要评估变化后的游戏空间
进行下一步行动，这样会改变约束条件的副作用效果凸显，自发行为突出。策略性就在其中，而策略性导致乐趣。如果玩家的某个行动不导致游戏空间的改变，
这种行动意义就不大了。

我要批注  简单规则作用在简单对象集合中，导致复杂性，而复杂性是自发性的温床。需要从数学上、实践上深入研究自发性，相信它是游戏好玩的秘籍。
需要用Ruby制造一个自发性发生引擎，简单规则作用在简单对象集合，不断调整，直到产生内在复杂性，得到好玩的结果。
需要阅读更多材料、更深入的材料，全面掌握自发性、简单与复杂。
** 应用
我要批注  上面这些方法，提供了改善明朝游戏有趣性的线索。一定要有针对性的研究。
现在游戏无趣，就是操作性动作少，因而行为少，缺乏策略。
一些改进想法：

*** 玩家采集（操作性动作），能影响自己和别人，能影响游戏空间的本质。 现在，只影响自己，乐趣和互动小。
改进思路：每个城市采集的次数有限，你采集一次，就少一次，别人不能采了（改变游戏空间本质）
     你采集的时候，动物会干扰你，打跑动物才能得到物品。
     你采集的时候，别的玩家会干扰你，PK赢了才能得到物品，否则被别的玩家抢走。
     你采集的时候，会捡到钱包（里面有元宝）

*** PK中心只有战斗，动词单一为"PK"
改进思路：
    玩家之间除了PK之外，还能偷盗、忽悠。（增加操作性动词）
   玩家A的妙手空空技能如果大于玩家B的“警惕之心”，A在PK中心对B实施“偷盗”，就有机会偷出B的一些金币或身上背包中的物品。
   玩家A的妙手空空技能如果小于玩家B的“警惕之心”，A在PK中心对B实施“偷盗”，就不能偷出B的一些金币或身上背包中的物品。

   玩家A的忽悠技能如果高于B的“警惕之心”，能够对B使用“忽悠”操作，随机让B的伙伴离开。

*** 针对副本的怪物，现在只有单一动词“打”
思路 
   针对副本的怪物，提供
   “塞钱收买”、“忽悠劝说”两个动词。
   “塞钱收买”，就是塞出1000完美刀，对方接受，玩家不通过战斗即可过关。------能够用多于一种的方法达成目标。
   “忽悠劝说”，就是玩家的“忽悠”和“亲和力”等级很高，对方接受，玩家通过劝说也能过关。----------能够用多于一种的方法达成目标。

*** 劳务市场的工作，有同一时刻工作人数的限制。
思路
  某工作，有下面标识（23/50),
  其中，23是当前工作人数，50是同时工作的人数上限。
原理：玩家工作，副作用就是占了别人的位置。
  会改变约束条件的副作用效果。
 

** 按
本透镜的实质在于，想办法扩大玩家面对的游戏状态空间。多个动词，能作用到多种对象上的动词，能够用多于一种的方法达成目标， 多个主语，
都是为了使用乘法原理扩大状态空间。s=AxBxC
会改变约束条件的副作用效果，其实就是让某个动词使状态空间的状态发生较大的改变。

** 实际例子
找你妹3中，142那么难的关，一个聪明的玩家用原子弹炸两屏，然后再找东西，效果好。
这种玩法，并不是设计初衷，但玩家发现了这种自发性玩法。比较有意思。

* 透镜　24  行为的透镜
** 透镜描述
思考哪些是玩家能做的，哪些是它们不能做的，以及为什么会这样。
问下面的问题
*** 我的游戏中有哪些操作性行为?
*** 我的游戏有哪些因而发生的行为?
*** 我希望看到哪些因而发生的行为，如何能调整游戏来上这种情况变得可能呢?
*** 我对目前因而发生的行为和操作性行为的比例满意吗？
*** 在我的游戏中有哪些行为是玩家希望能做但不能做的？我能一定程度上通过操作性行为或者因而发生的行为来让这些变得可能吗？

确定你的游戏拥有的行为会是你作为一名游戏设计师说要做的最基础的决定。对这些行为细小的改变都会对游戏产生巨大的影响，或者会
让游戏产生极大量自发性的玩法，或者让游戏性变得可预知和单调乏味，谨慎小心地选择你的各种行为，学会倾听你的游戏和你的玩家，以此了解
你的各种选择会让哪些东西变得可能。

* 透镜　25  目标的透镜
  
** 透镜描述
为了确保你游戏的目标是合适的，而且良好平衡的，问下面的问题：
*** 我的游戏中的终极目标是什么？
*** 这个目标对玩家来说清晰可见吗？
*** 假如有一系列目标，玩家能理解吗？
*** 各种不同的目标，以一种有意义的方式相互连接吗？
*** 我设定的目标，是具体、可达成、值得去做吗？
    好的目标，有下面三个特征：
****    1. 具体。
        玩家能理解和清晰地说明他们将要达成什么样的目标。
****    2. 可达成。
        玩家需要觉得自己有机会达成这目标。如果目标让他们觉得不可实现，他们很快就会放弃。
****    3. 值得去做。
        有很多方法让能达成的目标值得去做。
        假如达成目标是一种挑战，那么仅仅是达成目标的过程就是一种奖励了。
        更进一步，可以在玩家达成目标的时候，给玩家一些有价值的东西让你的目标更值得去做。----利用快乐透镜找出奖励玩家的多种
        方式（我要批注：如何具体落实），让玩家对自己达成的成就感到自豪。（老郭批准：给称号！）
        虽然玩家达成目标的时候给玩家奖励很重要，但在玩家达成目标之前让玩家觉得奖励极具奖励性更重要！如此玩家才雄心勃勃地去完成目标。(我要批注 :
        大闹天宫在战斗之前，先告诉玩家这次战斗预料玩家能够获得什么奖励，是很强的，学习之。)
*** 我设定的短期目标和长期目标是平衡的吗？
    这种长短期目标的平衡，能让玩家知道什么是当前立刻要做的，什么是最终要达成、而且更有吸引力的的目标。
*** 玩家有机会自己去制定目标吗？





* 透镜#26 规则的透镜
** 透镜描述
深入观察你的游戏，直到你能弄懂最深沉的结构。

**** 什么是我游戏的基础规则？这些规则和操作规则的区别是什么？
基础规则是对游戏状态、这些状态何时改变、以及对状态改变的数学表达。
Foundational rules are a mathematical representation of game state and how and
when it changes。

操作规则：玩家要做什么才能玩这个游戏。
Operational Rules


**** 随着游戏的进行，玩家之间能形成“法规”或“房规”吗？
法规----Law.
Laws: These only form when games are played in serious, competitive settings,
where the stakes are high enough that a need is felt to explicitly record the rules
of good sportsmanship.

房规
 house rules are usually created by players in response to a deficiency
perceived after a few rounds of play.



**** 在我的游戏中有不同模式吗？
**** 各种规则容易理解吗？规则间有让人混淆的地方吗？如果容易混淆，我应该修正规则还是进行详细解释？

** 扩展描述
** 应用
游戏就是规则的集合，你应该投入时间和精力。


* Lens #27: The Lens of Skill

To use this lens, stop looking at your game, and start looking at the skills you
are asking of your players.
Ask yourself these questions:
** ● What skills does my game require from the player?
** ● Are there categories of skill that this game is missing?
** ● Which skills are dominant?
** ● Are these skills creating the experience I want?
