game_design_notes.org
** ● Are some players much better at these skills than others? Does this make
   the game feel unfair?
** ● Can players improve their skills with practice?
** ● Does this game demand the right level of skill?



* 透镜#32 有意义的选择透镜
** 透镜描述
当我们在做出有意义的选择的时候，我们感觉自己当前做的事情是很重要的。问：
**** 我让玩家做什么样的选择呢？
**** 这些选择有意义吗？它们是如何有意义的？
**** 我给了玩家数量合适的选择了吗？更多的选择会让玩家感觉强大，还是更少的选择让游戏变得更清晰？
**** 在我的游戏中有什么最优策略吗？

** 扩展描述
一个好的游戏，往往给玩家很多有意义的选择。
但选择的数量要细致设计。太多，玩家迷惑。太少，玩家感觉失落。
** 应用

我要批注  原来设计的采集，玩家没有任何选择，系统随机给玩家特产或宝石，让玩家感觉自己无能为力。失去了乐趣。后来我把
特产和宝石分开，让玩家感觉有选择。玩家体验上升了。

** 按
有意义的选择，其实质在于给玩家较大的状态空间。如果选择小，则状态空间小。如果选择无意义，则状态空间小。

* 透镜#33 三角平衡的透镜
** 透镜描述
让游戏变得有趣和刺激的很好方法：
让玩家能选择：
*** 安稳地低收益地玩
*** 冒险，高收益地玩

问：
我在游戏中设计了三角平衡吗？如果没有，如何设计它呢？
这三角关系平衡么？换句话说，得到的报酬和承担的风险是旗鼓相当的吗？

如果你希望建立三角平衡，你需要四处寻找可着手的点。
一旦建立了这种三角平衡，游戏就精彩和刺激了。

** 扩展描述
《太空侵略者》建立了这种三角平衡。玩家可以打平常普通的怪，也可打从上部快速飞过的怪物，得到分数很多，但也很危险。

我要批注  其实就是提供玩家多项选择，每个选择的风险和报酬，符合等边际法则：经济学的边际收益比上边际投入要衡定。

** 应用



* 透镜#36  竞争的透镜
** 透镜描述
确定出谁在某事情上最厉害是人类一项最基本渴求。
利用这个透镜来确保你竞争类游戏让人们想在其中获胜。问：

*** 我的游戏对玩家技能给予了一种公平的衡量吗？
*** 玩家想在我的游戏中获胜吗？为什么？
*** 赢取这个游戏是人们骄傲的事情吗？为什么？
*** 新手玩家有意在我的游戏中竞争吗？
*** 老手玩家有意在我的游戏中竞争吗？
*** 老手玩家通常肯定打败新手玩家吗？




* 透镜#39  时间的透镜
体验会因为时间太短或者时间太长而不好。
为了求到合适的时间，问：
** 是什么决定了我游戏行为的时间长短？
有的是win and lose condition. 
注意到，糖果有一个关卡与时间有关。
      找你妹全部都与时间有关。

** 我的玩家是否因为玩的时间结束太早而不爽？
如果如此，应该如何改变呢？

** 我的玩家是否因为游戏时间太长而感到厌烦？
如果如此，应该如何改变呢？

** 给游戏增加一个时间限制是很刺激的！我的游戏能否这样？

** 一个混合型时间设定能提高我的游戏吗？
混合型的含义是：几个短的阶段，组合成一个长的阶段。

* 透镜40  奖励的透镜

** 奖励的类型：
*** 称赞
   通过声音、文字、角色等告诉你很好。实质：游戏评判和认同你了。
*** 分数
   简单的成就评判。很管用。
*** 延长游戏
   多一条命。
*** 一种门票
  新的关卡开启奖励，一道锁着门的钥匙。。。。。。
*** 壮观场面
  过场动画

*** 表现机会
  某些玩家喜欢以特别的衣服和装饰来表现自己。实质：满足玩家想要在这个世界留下自己的印记的基本需求。
*** 力量
  玩家想要变得更强大
*** 资源
  不用说了。
*** 完成游戏
 完成所有目标，能给玩家特殊的完满感。

** 给奖励的技巧
*** 给予多种奖励，组合起来（不光是静态组合----同时给两种以上奖励，而且有动态组合---某种奖励积累到一定的程度，再给另一种奖励）
*** 让奖励多变，而不是固定不变。
   实际例子：打败怪物给　10分奖励，人们觉得没意思。搞成：打败怪物，2/3的概率得0分，1/3机会得到30分，人们觉得这个奖励很好。


** 透镜描述
你的游戏时候在适当的时间给了玩家适当数量的奖励？问：
*** 我的游戏现在给出的是哪些奖励？它还能给出别的奖励吗？
*** 当玩家在游戏里得到奖励的时候，他们感到兴奋吗？还是感到厌烦呢？为什么会这样？

*** 给玩家不能理解的奖励，等同于不给玩家奖励。我的游戏玩家，都能理解他们得到的奖励吗？
*** 我游戏中的奖励给得太有规律了吗？它们能以更多变的方式给予吗？
*** 奖励之间是如何相互关联的？有方法能让它们更好地关联起来吗？
*** 我的奖励体系是如何建立起来的？是太快还是太慢还是刚刚好呢？

** 扩展描述

** 实际例子
*** 快速找东西？给你奖励
学霸给找东西加“真快”和“神速xN”。
如果每两次找东西之间的时间间隔很少，或者持续很少，则给玩家一个很帅
的评价“真快”和“神速xN”，伴有多汁酷爽的特效哦！
这个设计很好：
1. 正确地评价了玩家（参见评价的透镜）
2. 正确地奖励了玩家，给予了“称赞”，通过声音、文字、角色等告诉你很好。

*** 新主题之开启

新主题开启，把大量新的物件以很炫的展现方式“奖赏”给玩家
是一种很好的方式。


* 透镜41  处罚的透镜
使用处罚的时候需要非常谨慎。因为使用不当，玩家会离开。
如果平衡得好，玩家就很在乎，成功的时候也会很自豪。
问：
** 我游戏中，什么是处罚？
** 我为什么要处罚玩家？目的是什么？
** 我的处罚对于玩家公平吗？为什么？
** 是否有一种办法，能把处罚变成奖励，然后获得同样、甚至更好的效果？
** 我的强处罚是否已经与游戏中强奖励平衡了？

* 透镜42  简单/复杂的透镜

** 复杂的类型：
