game_design_notes.html
<div id="outline-container-sec-34-5" class="outline-3">
<h3 id="sec-34-5"><span class="section-number-3">34.5</span> ● Are some players much better at these skills than others? Does this make</h3>
<div class="outline-text-3" id="text-34-5">
<p>
the game feel unfair?
</p>
</div>
</div>

<div id="outline-container-sec-34-6" class="outline-3">
<h3 id="sec-34-6"><span class="section-number-3">34.6</span> ● Can players improve their skills with practice?</h3>
</div>
<div id="outline-container-sec-34-7" class="outline-3">
<h3 id="sec-34-7"><span class="section-number-3">34.7</span> ● Does this game demand the right level of skill?</h3>
</div>
</div>


<div id="outline-container-sec-35" class="outline-2">
<h2 id="sec-35"><span class="section-number-2">35</span> 透镜#32 有意义的选择透镜</h2>
<div class="outline-text-2" id="text-35">
</div><div id="outline-container-sec-35-1" class="outline-3">
<h3 id="sec-35-1"><span class="section-number-3">35.1</span> 透镜描述</h3>
<div class="outline-text-3" id="text-35-1">
<p>
当我们在做出有意义的选择的时候，我们感觉自己当前做的事情是很重要的。问：
</p>
</div>
<ol class="org-ol"><li>我让玩家做什么样的选择呢？<br/></li>
<li>这些选择有意义吗？它们是如何有意义的？<br/></li>
<li>我给了玩家数量合适的选择了吗？更多的选择会让玩家感觉强大，还是更少的选择让游戏变得更清晰？<br/></li>
<li>在我的游戏中有什么最优策略吗？<br/></li></ol>
</div>
<div id="outline-container-sec-35-2" class="outline-3">
<h3 id="sec-35-2"><span class="section-number-3">35.2</span> 扩展描述</h3>
<div class="outline-text-3" id="text-35-2">
<p>
一个好的游戏，往往给玩家很多有意义的选择。
但选择的数量要细致设计。太多，玩家迷惑。太少，玩家感觉失落。
</p>
</div>
</div>

<div id="outline-container-sec-35-3" class="outline-3">
<h3 id="sec-35-3"><span class="section-number-3">35.3</span> 应用</h3>
<div class="outline-text-3" id="text-35-3">
<p>
我要批注  原来设计的采集，玩家没有任何选择，系统随机给玩家特产或宝石，让玩家感觉自己无能为力。失去了乐趣。后来我把
特产和宝石分开，让玩家感觉有选择。玩家体验上升了。
</p>
</div>
</div>
<div id="outline-container-sec-35-4" class="outline-3">
<h3 id="sec-35-4"><span class="section-number-3">35.4</span> 按</h3>
<div class="outline-text-3" id="text-35-4">
<p>
有意义的选择，其实质在于给玩家较大的状态空间。如果选择小，则状态空间小。如果选择无意义，则状态空间小。
</p>
</div>
</div>
</div>
<div id="outline-container-sec-36" class="outline-2">
<h2 id="sec-36"><span class="section-number-2">36</span> 透镜#33 三角平衡的透镜</h2>
<div class="outline-text-2" id="text-36">
</div><div id="outline-container-sec-36-1" class="outline-3">
<h3 id="sec-36-1"><span class="section-number-3">36.1</span> 透镜描述</h3>
<div class="outline-text-3" id="text-36-1">
<p>
让游戏变得有趣和刺激的很好方法：
让玩家能选择：
</p>
</div>
<div id="outline-container-sec-36-1-1" class="outline-4">
<h4 id="sec-36-1-1"><span class="section-number-4">36.1.1</span> 安稳地低收益地玩</h4>
</div>
<div id="outline-container-sec-36-1-2" class="outline-4">
<h4 id="sec-36-1-2"><span class="section-number-4">36.1.2</span> 冒险，高收益地玩</h4>
<div class="outline-text-4" id="text-36-1-2">
<p>
问：
我在游戏中设计了三角平衡吗？如果没有，如何设计它呢？
这三角关系平衡么？换句话说，得到的报酬和承担的风险是旗鼓相当的吗？
</p>

<p>
如果你希望建立三角平衡，你需要四处寻找可着手的点。
一旦建立了这种三角平衡，游戏就精彩和刺激了。
</p>
</div>
</div>
</div>
<div id="outline-container-sec-36-2" class="outline-3">
<h3 id="sec-36-2"><span class="section-number-3">36.2</span> 扩展描述</h3>
<div class="outline-text-3" id="text-36-2">
<p>
《太空侵略者》建立了这种三角平衡。玩家可以打平常普通的怪，也可打从上部快速飞过的怪物，得到分数很多，但也很危险。
</p>

<p>
我要批注  其实就是提供玩家多项选择，每个选择的风险和报酬，符合等边际法则：经济学的边际收益比上边际投入要衡定。
</p>
</div>
</div>
<div id="outline-container-sec-36-3" class="outline-3">
<h3 id="sec-36-3"><span class="section-number-3">36.3</span> 应用</h3>
</div>
</div>


<div id="outline-container-sec-37" class="outline-2">
<h2 id="sec-37"><span class="section-number-2">37</span> 透镜#36  竞争的透镜</h2>
<div class="outline-text-2" id="text-37">
</div><div id="outline-container-sec-37-1" class="outline-3">
<h3 id="sec-37-1"><span class="section-number-3">37.1</span> 透镜描述</h3>
<div class="outline-text-3" id="text-37-1">
<p>
确定出谁在某事情上最厉害是人类一项最基本渴求。
利用这个透镜来确保你竞争类游戏让人们想在其中获胜。问：
</p>
</div>

<div id="outline-container-sec-37-1-1" class="outline-4">
<h4 id="sec-37-1-1"><span class="section-number-4">37.1.1</span> 我的游戏对玩家技能给予了一种公平的衡量吗？</h4>
</div>
<div id="outline-container-sec-37-1-2" class="outline-4">
<h4 id="sec-37-1-2"><span class="section-number-4">37.1.2</span> 玩家想在我的游戏中获胜吗？为什么？</h4>
</div>
<div id="outline-container-sec-37-1-3" class="outline-4">
<h4 id="sec-37-1-3"><span class="section-number-4">37.1.3</span> 赢取这个游戏是人们骄傲的事情吗？为什么？</h4>
</div>
<div id="outline-container-sec-37-1-4" class="outline-4">
<h4 id="sec-37-1-4"><span class="section-number-4">37.1.4</span> 新手玩家有意在我的游戏中竞争吗？</h4>
</div>
<div id="outline-container-sec-37-1-5" class="outline-4">
<h4 id="sec-37-1-5"><span class="section-number-4">37.1.5</span> 老手玩家有意在我的游戏中竞争吗？</h4>
</div>
<div id="outline-container-sec-37-1-6" class="outline-4">
<h4 id="sec-37-1-6"><span class="section-number-4">37.1.6</span> 老手玩家通常肯定打败新手玩家吗？</h4>
</div>
</div>
</div>



<div id="outline-container-sec-38" class="outline-2">
<h2 id="sec-38"><span class="section-number-2">38</span> 透镜#39  时间的透镜</h2>
<div class="outline-text-2" id="text-38">
<p>
体验会因为时间太短或者时间太长而不好。
为了求到合适的时间，问：
</p>
</div>
<div id="outline-container-sec-38-1" class="outline-3">
<h3 id="sec-38-1"><span class="section-number-3">38.1</span> 是什么决定了我游戏行为的时间长短？</h3>
<div class="outline-text-3" id="text-38-1">
<p>
有的是win and lose condition. 
注意到，糖果有一个关卡与时间有关。
      找你妹全部都与时间有关。
</p>
</div>
</div>
<div id="outline-container-sec-38-2" class="outline-3">
<h3 id="sec-38-2"><span class="section-number-3">38.2</span> 我的玩家是否因为玩的时间结束太早而不爽？</h3>
<div class="outline-text-3" id="text-38-2">
<p>
如果如此，应该如何改变呢？
</p>
</div>
</div>
<div id="outline-container-sec-38-3" class="outline-3">
<h3 id="sec-38-3"><span class="section-number-3">38.3</span> 我的玩家是否因为游戏时间太长而感到厌烦？</h3>
<div class="outline-text-3" id="text-38-3">
<p>
如果如此，应该如何改变呢？
</p>
</div>
</div>
<div id="outline-container-sec-38-4" class="outline-3">
<h3 id="sec-38-4"><span class="section-number-3">38.4</span> 给游戏增加一个时间限制是很刺激的！我的游戏能否这样？</h3>
</div>

<div id="outline-container-sec-38-5" class="outline-3">
<h3 id="sec-38-5"><span class="section-number-3">38.5</span> 一个混合型时间设定能提高我的游戏吗？</h3>
<div class="outline-text-3" id="text-38-5">
<p>
混合型的含义是：几个短的阶段，组合成一个长的阶段。
</p>
</div>
</div>
</div>
<div id="outline-container-sec-39" class="outline-2">
<h2 id="sec-39"><span class="section-number-2">39</span> 透镜40  奖励的透镜</h2>
<div class="outline-text-2" id="text-39">
</div><div id="outline-container-sec-39-1" class="outline-3">
<h3 id="sec-39-1"><span class="section-number-3">39.1</span> 奖励的类型：</h3>
<div class="outline-text-3" id="text-39-1">
</div><div id="outline-container-sec-39-1-1" class="outline-4">
<h4 id="sec-39-1-1"><span class="section-number-4">39.1.1</span> 称赞</h4>
<div class="outline-text-4" id="text-39-1-1">
<p>
通过声音、文字、角色等告诉你很好。实质：游戏评判和认同你了。
</p>
</div>
</div>

<div id="outline-container-sec-39-1-2" class="outline-4">
<h4 id="sec-39-1-2"><span class="section-number-4">39.1.2</span> 分数</h4>
<div class="outline-text-4" id="text-39-1-2">
<p>
简单的成就评判。很管用。
</p>
</div>
</div>

<div id="outline-container-sec-39-1-3" class="outline-4">
<h4 id="sec-39-1-3"><span class="section-number-4">39.1.3</span> 延长游戏</h4>
<div class="outline-text-4" id="text-39-1-3">
<p>
多一条命。
</p>
</div>
</div>

<div id="outline-container-sec-39-1-4" class="outline-4">
<h4 id="sec-39-1-4"><span class="section-number-4">39.1.4</span> 一种门票</h4>
<div class="outline-text-4" id="text-39-1-4">
<p>
新的关卡开启奖励，一道锁着门的钥匙。。。。。。
</p>
</div>
</div>

<div id="outline-container-sec-39-1-5" class="outline-4">
<h4 id="sec-39-1-5"><span class="section-number-4">39.1.5</span> 壮观场面</h4>
<div class="outline-text-4" id="text-39-1-5">
<p>
过场动画
</p>
</div>
</div>
<div id="outline-container-sec-39-1-6" class="outline-4">
<h4 id="sec-39-1-6"><span class="section-number-4">39.1.6</span> 表现机会</h4>
<div class="outline-text-4" id="text-39-1-6">
<p>
某些玩家喜欢以特别的衣服和装饰来表现自己。实质：满足玩家想要在这个世界留下自己的印记的基本需求。
</p>
</div>
</div>

<div id="outline-container-sec-39-1-7" class="outline-4">
<h4 id="sec-39-1-7"><span class="section-number-4">39.1.7</span> 力量</h4>
<div class="outline-text-4" id="text-39-1-7">
<p>
玩家想要变得更强大
</p>
</div>
</div>

<div id="outline-container-sec-39-1-8" class="outline-4">
<h4 id="sec-39-1-8"><span class="section-number-4">39.1.8</span> 资源</h4>
<div class="outline-text-4" id="text-39-1-8">
<p>
不用说了。
</p>
</div>
</div>

<div id="outline-container-sec-39-1-9" class="outline-4">
<h4 id="sec-39-1-9"><span class="section-number-4">39.1.9</span> 完成游戏</h4>
<div class="outline-text-4" id="text-39-1-9">
<p>
完成所有目标，能给玩家特殊的完满感。
</p>
</div>
</div>
</div>
<div id="outline-container-sec-39-2" class="outline-3">
<h3 id="sec-39-2"><span class="section-number-3">39.2</span> 给奖励的技巧</h3>
<div class="outline-text-3" id="text-39-2">
</div><div id="outline-container-sec-39-2-1" class="outline-4">
<h4 id="sec-39-2-1"><span class="section-number-4">39.2.1</span> 给予多种奖励，组合起来（不光是静态组合-&#x2014;同时给两种以上奖励，而且有动态组合&#x2014;某种奖励积累到一定的程度，再给另一种奖励）</h4>
</div>
<div id="outline-container-sec-39-2-2" class="outline-4">
<h4 id="sec-39-2-2"><span class="section-number-4">39.2.2</span> 让奖励多变，而不是固定不变。</h4>
<div class="outline-text-4" id="text-39-2-2">
<p>
实际例子：打败怪物给　10分奖励，人们觉得没意思。搞成：打败怪物，2/3的概率得0分，1/3机会得到30分，人们觉得这个奖励很好。
</p>
</div>
</div>
</div>

<div id="outline-container-sec-39-3" class="outline-3">
<h3 id="sec-39-3"><span class="section-number-3">39.3</span> 透镜描述</h3>
<div class="outline-text-3" id="text-39-3">
<p>
你的游戏时候在适当的时间给了玩家适当数量的奖励？问：
</p>
</div>
<div id="outline-container-sec-39-3-1" class="outline-4">
<h4 id="sec-39-3-1"><span class="section-number-4">39.3.1</span> 我的游戏现在给出的是哪些奖励？它还能给出别的奖励吗？</h4>
</div>
<div id="outline-container-sec-39-3-2" class="outline-4">
<h4 id="sec-39-3-2"><span class="section-number-4">39.3.2</span> 当玩家在游戏里得到奖励的时候，他们感到兴奋吗？还是感到厌烦呢？为什么会这样？</h4>
</div>

<div id="outline-container-sec-39-3-3" class="outline-4">
<h4 id="sec-39-3-3"><span class="section-number-4">39.3.3</span> 给玩家不能理解的奖励，等同于不给玩家奖励。我的游戏玩家，都能理解他们得到的奖励吗？</h4>
</div>
<div id="outline-container-sec-39-3-4" class="outline-4">
<h4 id="sec-39-3-4"><span class="section-number-4">39.3.4</span> 我游戏中的奖励给得太有规律了吗？它们能以更多变的方式给予吗？</h4>
</div>
<div id="outline-container-sec-39-3-5" class="outline-4">
<h4 id="sec-39-3-5"><span class="section-number-4">39.3.5</span> 奖励之间是如何相互关联的？有方法能让它们更好地关联起来吗？</h4>
</div>
<div id="outline-container-sec-39-3-6" class="outline-4">
<h4 id="sec-39-3-6"><span class="section-number-4">39.3.6</span> 我的奖励体系是如何建立起来的？是太快还是太慢还是刚刚好呢？</h4>
</div>
</div>
<div id="outline-container-sec-39-4" class="outline-3">
<h3 id="sec-39-4"><span class="section-number-3">39.4</span> 扩展描述</h3>
</div>

<div id="outline-container-sec-39-5" class="outline-3">
<h3 id="sec-39-5"><span class="section-number-3">39.5</span> 实际例子</h3>
<div class="outline-text-3" id="text-39-5">
</div><div id="outline-container-sec-39-5-1" class="outline-4">
<h4 id="sec-39-5-1"><span class="section-number-4">39.5.1</span> 快速找东西？给你奖励</h4>
<div class="outline-text-4" id="text-39-5-1">
<p>
学霸给找东西加“真快”和“神速xN”。
如果每两次找东西之间的时间间隔很少，或者持续很少，则给玩家一个很帅
的评价“真快”和“神速xN”，伴有多汁酷爽的特效哦！
这个设计很好：
</p>
<ol class="org-ol">
<li>正确地评价了玩家（参见评价的透镜）
</li>
<li>正确地奖励了玩家，给予了“称赞”，通过声音、文字、角色等告诉你很好。
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-39-5-2" class="outline-4">
<h4 id="sec-39-5-2"><span class="section-number-4">39.5.2</span> 新主题之开启</h4>
<div class="outline-text-4" id="text-39-5-2">
<p>
新主题开启，把大量新的物件以很炫的展现方式“奖赏”给玩家
是一种很好的方式。
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-40" class="outline-2">
<h2 id="sec-40"><span class="section-number-2">40</span> 透镜41  处罚的透镜</h2>
<div class="outline-text-2" id="text-40">
<p>
使用处罚的时候需要非常谨慎。因为使用不当，玩家会离开。
如果平衡得好，玩家就很在乎，成功的时候也会很自豪。
问：
</p>
</div>
<div id="outline-container-sec-40-1" class="outline-3">
<h3 id="sec-40-1"><span class="section-number-3">40.1</span> 我游戏中，什么是处罚？</h3>
</div>
<div id="outline-container-sec-40-2" class="outline-3">
<h3 id="sec-40-2"><span class="section-number-3">40.2</span> 我为什么要处罚玩家？目的是什么？</h3>
</div>
<div id="outline-container-sec-40-3" class="outline-3">
<h3 id="sec-40-3"><span class="section-number-3">40.3</span> 我的处罚对于玩家公平吗？为什么？</h3>
</div>
<div id="outline-container-sec-40-4" class="outline-3">
<h3 id="sec-40-4"><span class="section-number-3">40.4</span> 是否有一种办法，能把处罚变成奖励，然后获得同样、甚至更好的效果？</h3>
</div>
<div id="outline-container-sec-40-5" class="outline-3">
<h3 id="sec-40-5"><span class="section-number-3">40.5</span> 我的强处罚是否已经与游戏中强奖励平衡了？</h3>
</div>
</div>
