game_design_notes.html
<div id="outline-container-sec-41" class="outline-2">
<h2 id="sec-41"><span class="section-number-2">41</span> 透镜42  简单/复杂的透镜</h2>
<div class="outline-text-2" id="text-41">
</div><div id="outline-container-sec-41-1" class="outline-3">
<h3 id="sec-41-1"><span class="section-number-3">41.1</span> 复杂的类型：</h3>
<div class="outline-text-3" id="text-41-1">
</div><div id="outline-container-sec-41-1-1" class="outline-4">
<h4 id="sec-41-1-1"><span class="section-number-4">41.1.1</span> 天生复杂度</h4>
<div class="outline-text-4" id="text-41-1-1">
<p>
Innate complexity. When the very rules of the game get very complex, I call this
innate complexity. This is the kind of complexity that often gets a bad name. It
generally arises either because the designer is trying to simulate a complex real-
world situation, or because extra rules need to be added to a game in order to
balance it. When you see a ruleset with lots of “exception cases,” this is gener-
ally a ruleset that is innately complex. Games like this can be hard to learn, but
some people really enjoy mastering the complex rulesets.
</p>
</div>
</div>

<div id="outline-container-sec-41-1-2" class="outline-4">
<h4 id="sec-41-1-2"><span class="section-number-4">41.1.2</span> 自发复杂度</h4>
<div class="outline-text-4" id="text-41-1-2">
<p>
Emergent complexity. This is the kind of complexity that everyone praises.
Games like Go that have a very simple ruleset that gives rise to very complex sit-
uations are said to have emergent complexity. When games are praised for being
simple and complex at the same time, it is the emergent complexity that is being
praised.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-41-2" class="outline-3">
<h3 id="sec-41-2"><span class="section-number-3">41.2</span> 透镜描述</h3>
<div class="outline-text-3" id="text-41-2">
<p>
追求：在一个简单的系统中产生出有意义的复杂度。
</p>
</div>
<div id="outline-container-sec-41-2-1" class="outline-4">
<h4 id="sec-41-2-1"><span class="section-number-4">41.2.1</span> 我游戏中，有哪些元素是具有天生复杂程度的？</h4>
</div>
<div id="outline-container-sec-41-2-2" class="outline-4">
<h4 id="sec-41-2-2"><span class="section-number-4">41.2.2</span> 这些天生复杂度有途径能转变成自发复杂度吗？</h4>
</div>

<div id="outline-container-sec-41-2-3" class="outline-4">
<h4 id="sec-41-2-3"><span class="section-number-4">41.2.3</span> 在游戏中，有产生自发复杂度吗？如果没有，为什么不能产生呢？</h4>
</div>

<div id="outline-container-sec-41-2-4" class="outline-4">
<h4 id="sec-41-2-4"><span class="section-number-4">41.2.4</span> 我游戏中哪些元素太过简单了？</h4>
</div>
</div>
<div id="outline-container-sec-41-3" class="outline-3">
<h3 id="sec-41-3"><span class="section-number-3">41.3</span> 扩展描述</h3>
</div>

<div id="outline-container-sec-41-4" class="outline-3">
<h3 id="sec-41-4"><span class="section-number-3">41.4</span> 实际例子</h3>
<div class="outline-text-3" id="text-41-4">
<p>
《找你妹2014》的物品，每个都简单，容易认，但放到一起，就复杂难找了。
好像就是，“简单”的堆彻，最终照成复杂？
</p>
</div>
</div>
<div id="outline-container-sec-41-5" class="outline-3">
<h3 id="sec-41-5"><span class="section-number-3">41.5</span> 我要批注</h3>
<div class="outline-text-3" id="text-41-5">
<p>
其实就是量变产生质变？
</p>
</div>
<div id="outline-container-sec-41-5-1" class="outline-4">
<h4 id="sec-41-5-1"><span class="section-number-4">41.5.1</span> 围棋</h4>
<div class="outline-text-4" id="text-41-5-1">
<p>
《围棋》的确是用简单规则达到自发性复杂的经典。
但是。。。。在我们游戏设计中，如何达到这一点呢？难啊。需要设计天才。
</p>
</div>
</div>

<div id="outline-container-sec-41-5-2" class="outline-4">
<h4 id="sec-41-5-2"><span class="section-number-4">41.5.2</span> 找你妹</h4>
<div class="outline-text-4" id="text-41-5-2">
<p>
每个物件都很简单，但放到一起，要找就比较麻烦了，复杂了。
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-42" class="outline-2">
<h2 id="sec-42"><span class="section-number-2">42</span> Lens #43: The Lens of Elegance</h2>
<div class="outline-text-2" id="text-42">
</div><div id="outline-container-sec-42-1" class="outline-3">
<h3 id="sec-42-1"><span class="section-number-3">42.1</span> 描述</h3>
<div class="outline-text-3" id="text-42-1">
<p>
 Most “classic games” are considered to be masterpieces of elegance. Use this
lens to make your game as elegant as possible. Ask yourself these questions:
 What are the elements of my game?
</p>
</div>
<div id="outline-container-sec-42-1-1" class="outline-4">
<h4 id="sec-42-1-1"><span class="section-number-4">42.1.1</span> What are the purposes of each element? Count these up to give the element an “elegance rating.”</h4>
</div>
<div id="outline-container-sec-42-1-2" class="outline-4">
<h4 id="sec-42-1-2"><span class="section-number-4">42.1.2</span> For elements with only one or two purposes, can some of these be combined into each other, or removed altogether?</h4>
</div>
<div id="outline-container-sec-42-1-3" class="outline-4">
<h4 id="sec-42-1-3"><span class="section-number-4">42.1.3</span> For elements with several purpose is it possible for them to take on even more?</h4>
</div>
</div>
<div id="outline-container-sec-42-2" class="outline-3">
<h3 id="sec-42-2"><span class="section-number-3">42.2</span> 应用</h3>
<div class="outline-text-3" id="text-42-2">
<p>
需要逐条分析游戏的元素。
尽量确保元素不再增加的条件下，增加单个元素扛的目标数量，
从而增加游戏乐趣,同时又保证了游戏较为简单。
</p>

<p>
找你妹3的钥匙，是单一目的元素：只能开启隐藏关卡。所以设计上是不成功的。
如何改进？如果玩家拥有足够的钥匙，就能开启一个新关卡？
</p>
</div>
</div>
</div>

<div id="outline-container-sec-43" class="outline-2">
<h2 id="sec-43"><span class="section-number-2">43</span> 透镜#44 特色的透镜</h2>
<div class="outline-text-2" id="text-43">
</div><div id="outline-container-sec-43-1" class="outline-3">
<h3 id="sec-43-1"><span class="section-number-3">43.1</span> 描述</h3>
<div class="outline-text-3" id="text-43-1">
<p>
1.在我的游戏里面，有什么东西是很奇怪并且人们谈起来很兴奋？
2.我的游戏中，有着让它独一无二有趣特质的东西吗？
3.我的游戏中，有玩家喜欢的瑕疵吗？
</p>
</div>
</div>

<div id="outline-container-sec-43-2" class="outline-3">
<h3 id="sec-43-2"><span class="section-number-3">43.2</span> 扩展</h3>
<div class="outline-text-3" id="text-43-2">
<p>
其实，一些奇怪的设定出现在经典游戏，例如超级玛丽的管子工，地产大亨的船和鞋子之类。
游戏成了，这些设定就是“特色”了，如果游戏没成，设定也就是浮云而已。
</p>
</div>
</div>
</div>


<div id="outline-container-sec-44" class="outline-2">
<h2 id="sec-44"><span class="section-number-2">44</span> 透镜#49 进展可见的透镜</h2>
<div class="outline-text-2" id="text-44">
</div><div id="outline-container-sec-44-1" class="outline-3">
<h3 id="sec-44-1"><span class="section-number-3">44.1</span> 透镜描述</h3>
<div class="outline-text-3" id="text-44-1">
<p>
当玩家在解决一个复杂困难的问题时，他们需要看到自己正在做出的进展。
为了确保他们得到这种反馈，问自己下面的问题。
</p>
</div>
<ol class="org-ol"><li>在我的游戏或迷题中，到底什么才算是做出了进展？<br/></li>
<li>在我的游戏或迷题中，是否有足够多的进展？我有办法为其加入更多的进展吗？<br/></li>
<li>哪些进展是可见的，哪些进展是隐蔽的？我有办法揭示出这些隐蔽的进展吗？<br/></li></ol>
</div>
<div id="outline-container-sec-44-2" class="outline-3">
<h3 id="sec-44-2"><span class="section-number-3">44.2</span> 扩展描述</h3>
<div class="outline-text-3" id="text-44-2">
<p>
让人们继续坚持搞完魔方游戏的很重要一点，在于它提供了进展感。
</p>
</div>
</div>
<div id="outline-container-sec-44-3" class="outline-3">
<h3 id="sec-44-3"><span class="section-number-3">44.3</span> 应用</h3>
<div class="outline-text-3" id="text-44-3">
<p>
手机游戏”糖果“的那地图，把进展可见搞到极致了，效果很好。
</p>

<p>
我要批注  “进展可见”的确很好。
对明朝的改进，一个重要方面就是确保了“进展可见”。具体表现在：
</p>
</div>
<div id="outline-container-sec-44-3-1" class="outline-4">
<h4 id="sec-44-3-1"><span class="section-number-4">44.3.1</span> 玩家打副本，进展可见。</h4>
<div class="outline-text-4" id="text-44-3-1">
<p>
原来的版本，“副本”就是“副本”，玩家不知道为什么要打它。打它有什么好处？我有什么进展？很迷茫。
改进思路：改为“过关通道”，并且加了Tips来显示“通向成都，打通率35%”。
做法评述：“过关通道”使玩家有清晰的目标感。
       “通向成都，打通率35%”。是进展可见。
</p>

<p>
原来的版本，副本中，每打通副本一个怪物，没有提供进展的报告。
改进思路：每打败一个怪物，就出现“过关进度：25%"这种提示，给了玩家具体、强烈的进展可见。
做法评述：
      玩家有很强的目标感和明确具体的进展可见。因此，玩家体验上来了。
</p>

<p>
改进思路：上一关、下一关处，出现这个过关通道的总关数，当前打通关数，这个也能给玩家明确的进展信息。
</p>

<p>
英文原文：
</p>

<p>
Lens #49: The Lens of Visible Progress
Players need to see that they are making progress when solving a difficult prob-
lem. To make sure they are getting this feedback, ask yourself these questions:
● What does it mean to make progress in my game or puzzle?
● Is there enough progress in my game? Is there a way I can add more interim
   steps of progressive success?
● What progress is visible, and what progress is hidden? Can I find a way to
   reveal what is hidden?
</p>
</div>
</div>

<div id="outline-container-sec-44-3-2" class="outline-4">
<h4 id="sec-44-3-2"><span class="section-number-4">44.3.2</span> 科举考试</h4>
<div class="outline-text-4" id="text-44-3-2">
<p>
原来版本，”科举考场“下面，没有写明白玩家的奋斗目标，让玩家困惑。
改进思路：
   改为”考学目标：进士“，目标感就清晰了。
进一步改进：
   改为”考进士(56%)“，则进展更可见。
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-45" class="outline-2">
<h2 id="sec-45"><span class="section-number-2">45</span> 透镜57 反馈的透镜</h2>
<div class="outline-text-2" id="text-45">
<p>
玩家从游戏中得到的反馈包括方方面面的内容：例如评判，奖励，指引，鼓励和挑战。
利用这个透镜来确保你的反馈循环能产生你想要的体验。
在游戏的每个时刻，都问问自己以下的问题：
</p>
</div>
<div id="outline-container-sec-45-1" class="outline-3">
<h3 id="sec-45-1"><span class="section-number-3">45.1</span> 透镜描述</h3>
<div class="outline-text-3" id="text-45-1">
<p>
玩家在此刻需要了解什么呢？(need to know)-&#x2014;&gt;系统需要让玩家知道的
玩家在此刻想要了解什么呢？(want to know)-&#x2014;&gt;站在玩家角度想的
你希望玩家在此刻感受到什么呢？如何给予反馈能产生这种感受？
玩家在此刻想要感受到什么呢？她们有机会去建立一种情景来得到她们想要的感受吗？
玩家此刻的目标是什么？什么样的反馈有助于她们更接近这个目标呢？
</p>
</div>
</div>
<div id="outline-container-sec-45-2" class="outline-3">
<h3 id="sec-45-2"><span class="section-number-3">45.2</span> 扩展描述</h3>
<div class="outline-text-3" id="text-45-2">
<p>
使用这个透镜会耗费你不少的精力，因为一个游戏中的反馈是需要连续不断的，并且需要在不同的情况下给出不同的反馈。
这需要在游戏中的每个时刻都耗费一定的心力去使用这个透镜，但是你花的这些时间都是很值得的，因为它有助于确保你的
游戏是清晰的、具有挑战性的和值得去玩的。
</p>
</div>
</div>
<div id="outline-container-sec-45-3" class="outline-3">
<h3 id="sec-45-3"><span class="section-number-3">45.3</span> 应用</h3>
<div class="outline-text-3" id="text-45-3">
<p>
没有反馈的体验，是充满挫败和让人不知所措的。美国和英国过街按钮的对比：前者不给反馈，让用户相当抓狂，后者给予了反馈，用户体验很好。
实际案例：黑光HD的第一版，地图界面，有个闪动的双剑。指示玩家这个地方可点击。但玩家点击后，没有任何反馈。因为
需要点击双剑下面的地图按钮。这种设计，是没有反馈，带来很大的挫败感。
</p>

<p>
我要批注  应该对每个界面(Interface)、在游戏进行的每个时刻(Movement)，问这些问题并试图解决之。这样，游戏才能对玩家体贴、友好。
        对于(I,M)二维矩阵，问问题。 
我要批注  重视玩家体验，就是理解和重视玩家的苦衷。可以动用这个透镜来实际提升。
</p>
</div>
</div>
</div>

<div id="outline-container-sec-46" class="outline-2">
<h2 id="sec-46"><span class="section-number-2">46</span> 透镜58 多汁的透镜</h2>
<div class="outline-text-2" id="text-46">
</div><div id="outline-container-sec-46-1" class="outline-3">
<h3 id="sec-46-1"><span class="section-number-3">46.1</span> 透镜描述</h3>
<div class="outline-text-3" id="text-46-1">
<p>
有干巴巴的界面，也有多汁的界面。
为设计出多汁的界面：
</p>
<ol class="org-ol">
<li>我的界面，给了玩家行为持续的反馈吗？
</li>
<li>玩家的行为，产生了二级动作吗？二级动作是否强大和有趣呢？
</li>
<li>多汁系统在奖励玩家的时候，会同时用多种方法哦！我在奖励玩家的时候，我能用多少种方法呢？我能
找到更多方法吗？
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-46-2" class="outline-3">
<h3 id="sec-46-2"><span class="section-number-3">46.2</span> 应用</h3>
<div class="outline-text-3" id="text-46-2">
<p>
这个多汁的界面，其实做的经典的是“Candy Crush”,效果相当好。
</p>
<ol class="org-ol">
<li>地图上，玩家所在最新位置，有光晕在动。
</li>
<li>糖果画得绚丽饱满，想舔。
</li>
<li>玩家的一个行动，可能引发二级动作（糖果爆炸等），强大而有趣。
</li>
<li>按钮一动一动的。
</li>
</ol>
</div>
</div>
</div>
