game_design_notes.org
* 透镜59 渠道和维度的透镜
任何界面的重要目标是传达信息。确定出传达必要的信息的最佳方式。步骤：
1. 列出所有信息并且划分优先等级。
   不是所有的信息都重要，因此要对信息划分等级： 每时每刻都要看的信息、经常看的信息、只需偶然看看的信息。
2. 列出信息传达的渠道
   也就是显示信息的区域，比如屏幕顶部、右下角，音效、音乐，角色聊天泡泡等。
3. 把信息映射到渠道上
   把各类信息映射到不同的渠道上。重要的信息，在最重要的渠道上。方法：部分靠直觉，部分靠经验，大部分靠反复试验---绘制很多草图。
4. 信息的维度玩家从游戏中得到的反馈包括方方面面的内容：例如评判，奖励，指引，鼓励和挑战。
利用这个透镜来确保你的反馈循环能产生你想要的体验。
在游戏的每个时刻，都问问自己以下的问题：

   每一个信息渠道都有多种维度：
    显示出数字
    数字的颜色
    数字的大小
    数字的字体
   当你在一个渠道上用多种维度来强化一项信息时，能够让你想要传达的信息变得非常清晰（多汁）。
对渠道和维度的出色利用能够打造出一个简练和布局良好的界面。

** 透镜描述
选择如何去把游戏信息映射到各种渠道和维度上是设计游戏界面的核心。问：
有哪些数据需要传达给玩家呢？又有哪些数据需要从玩家那里传来呢？
哪些数据是最重要的？
我有哪些渠道能够用来传达这些数据？
哪些渠道最合适传达哪些数据？为什么？
在不同渠道上，有哪些维度是可用的？
我该如何利用这些维度呢？

** 扩展描述


** 应用



* 透镜61 兴趣曲线的透镜
兴趣曲线是你作为游戏设计师能用上的最有用和最具多用途的工具。
** 透镜描述
能迷惑住人心的事物对于每个人都是不同的。但最让人接受的迷惑方式明显是对于每个人都类似的。
为了了解玩家的兴趣在你设计的体验过程中随时间是如何变化的，问一下自己：
*** 假如我对我的体验绘制一条兴趣曲线，那它大概是什么样的形状的？

*** 它会有一处勾人的地方吗？
*** 他有着兴趣的逐步提升，且具备周期性的休息中断吗？
*** 体验里，有一个比任何事情都有趣的大结局吗？
*** 什么样的调整，能让我拥有一条更棒的兴趣曲线吗？
*** 在我的兴趣曲线中有分形结构吗？它应该具备吗？
*** 我直觉觉察到的兴趣曲线，和观察玩家所了解到的兴趣曲线一致程度如何？如果让玩家来绘制兴趣曲线，是怎么样的呢？

** 扩展描述

** 应用

古琴音乐节的演出，就明显有一个故意制造出的兴趣曲线。艺术是相通的啊。 

项目Z中，要在一开始游戏出一个显著不同的美术效果，然后在玩几局之后，出一个
物品只有轮廓的玩法，这是为了提兴趣曲线。

* 透镜63 美好事物的透镜
诗般表现：Poetry of Presentation
体验时候用到的艺术元素越美好，则观众会觉得它越有趣和越吸引。
我们喜欢体会各种极为美好的事务。通过下面的问题，确保你的游戏充满兴趣：
** 透镜描述
*** 哪些元素组成了我的游戏？如何能让每种元素变得更美好？
*** 有些事物本身并不美好，但组合起来就变得美好了。我的游戏中各种元素能够通过组合变得如诗般美好？
*** 在我的游戏背景下，美好意味着什么？
  

* 透镜  66  障碍的透镜  <----->透镜25  目标的透镜
** 透镜描述
这个透镜，是“目标透镜”的姊妹透镜！
一个有着各种障碍的目标是值得追求的。
利用这个透镜来确保你的各种障碍是玩家想要克服的障碍。
1. 主角和目标有着什么样的关系？为什么角色会在意这个目标？
2. 角色和目标之间有着哪些障碍？
3. 在这些障碍背后存在敌对的双方吗？主角和敌对双方之间的关系是什么样的？
4. 这些障碍在难度上是逐渐提升的吗？
5. 有人说，障碍越大，故事越好，你的障碍足够大吗？它们还可以足够大吗？
6. 出色的故事往往包含着主角为了克服障碍所作出的转变。你的主角是如何转变的？

** 扩展描述
好莱坞电影剧本创作的古老箴言：
一个好的故事主要组成材料是：1）一个有着特定目标的角色 2）阻碍他达成目标的各种障碍。
在角色尝试去克服障碍的过程中，各种有趣的冲突也会随着产生。
** 应用
明朝中，明确告诉玩家，需要克服各种障碍去下一个城市。
** 新观察  2013年05月20日 12:00:05
手游中，存在一个奇怪现象：
一开始的关貌似简单，但是就是过不去，玩家就会一次又一次尝试，反而增加了游戏的魅力以及玩家玩它的动力。例子：
《暴走大冒险》、《找你妹》
关键点在于：
1, 貌似简单，但过不了关，照成玩家巨大反差和惊愕
2, 挑拨了玩家的感情，心里不服，就是想过去
3，手游与页游平台不一样，玩家习惯不一样。同样的设计在页游上是不行的。

* 故事语法:英雄历程(Hero’s Journey)
Vogler’s Synopsis of the Hero’s Journey
1. The Ordinary World — Establishing scenes that show our hero is a regular per-
son leading an ordinary life.
2. The Call to Adventure — The hero is presented with a challenge that disrupts
their ordinary life.
3. Refusal of the Call — The hero makes excuses about why he can’t go on the
adventure.
4. Meeting with the Mentor — Some wise figure gives advice, training, or aid.
5. Crossing the Threshold — The hero leaves the ordinary world (often under
pressure) and enters the adventure world.
6. Tests, Allies, Enemies — The hero faces minor challenges, makes allies, con-
fronts enemies, and learns the workings of the adventure world.
7. Approaching the Cave — The hero encounters setbacks and needs to try some-
thing new.
8. The Ordeal — The hero faces a peak life or death crisis.
9. The Reward — The hero survives, overcomes their fear, and gets the reward.
10. The Road Back — The hero returns to the ordinary world, but the problems still
aren’t all solved.
11. Resurrection — The hero faces a still greater crisis, and has to use everything
he has learned.
12. Returning with the Elixir — The journey is now well and truly complete,
and the hero’s success has improved the lives of everyone in the ordinary
world.

** 黑客帝国的剧情
完全符合上述故事文法，虽然俗，但效果很好。

* Lens #68: The Lens of the Hero’s Journey
Many heroic stories have similar structure. Use this lens to make sure you
haven’t missed out on any elements that might improve your story. Ask your-
self these questions:
● Does my story have elements that qualify it as a heroic story?
● If so, how does it match up with the structure of the Hero’s Journey?
● Would my story be improved by including more archetypical elements?
● Does my story match this form so closely that it feels hackneyed?
  过于接近这种形式以至于让人觉得陈腐吗？


* 透镜#72  间接控制的透镜
使用间接的（而不是直接的）手段，让玩家被微妙地影响来获得设计者设定的最佳体验。
** 间接控制手段一：限制
通过提供有限的选择，来给玩家一种自由感，其实比给玩家填空题（最大自由）进行
了限制。而且选择自身的设定上就可达到进行控制的意图。
相比最大自由，人们其实喜欢和认可这种限制。例子就是作者在公园卖不同口味糖果。
1.让顾客自己报需要什么，顾客迟疑并不知道该如何报。
2.报给顾客60种口味，顾客晕菜并且恐惧。
3.让顾客从6种所谓最受欢迎的口味中选择，顾客就高兴了。
 
** 间接控制手段二：目标
通过设置目标来控制玩家，是最简单最常用的手段。
一旦设置了清晰且可以达成的目标后，你就可以通过目标来雕琢你的游戏世界了。
玩家只会去那些有目标的场所。
玩家只会做满足目标的事情。

** 间接控制手段三：界面
（原文中文译文没看懂，需要看英文原文）
大明的考试结束界面中，如果玩家20题中有错题，则界面中有一个很大的按钮
“我不服，要全对”和一个很小的按钮“算了，我认栽”。
前面那个大按钮是要花钱的。
通过这种界面控制，间接诱导玩家花钱。

** 间接控制手段四：视觉设计
一些视觉上的设计，能微妙、润物无声地控制（诱导）玩家的行为。作者给出的
例子：玩家面对宫殿王座的行为：直接飞过去，闪到两边去，都由美术设计（画线）
诱导成功了。
项目Z的地图上，姐姐头像面对最新关卡一闪一闪，也是类似。

** 间接控制手段五：角色
角色也是间接控制玩家的手段。
如果能让玩家在意角色----让他们真心去服从、保护、帮助和毁灭这些角色，你就
有了很好的工具来帮助你控制玩家愿意尝试去做的事。

** 间接控制手段六：音乐
用音乐来控制游戏节奏。
快餐店和商场一直在用这种手段。



** 提问
*** 理想来说，我想让玩家做什么事情？
*** 我能设定各种限制来让玩家做这些事情吗？
