game_design_notes.org
*** 我能设定各种目标来让玩家做这些事情吗？
*** 我能设定界面来让玩家做这些事情吗？
*** 我能用视觉设计来让玩家做这些事情吗？
*** 我能用角色来让玩家做这些事情吗？
*** 我能用音乐（音效）来让玩家做这些事情吗？
*** 还有什么方法，我能用来控制玩家，但又没有侵害玩家的自由感？
应该是行为-奖励这种模式吧，参考skiner-box

* 透镜#73  合谋的透镜
其实这个透镜，就是综合应用间接控制的透镜。
设计师和游戏角色一起合谋，为玩家创造最优体验，把目标，角色和视觉设计都朝着单个统一的效果联合在一起。
实际例子：
《海盗之战》在5分钟之内创造优异的互动体验：我们让角色有两个同时并存的目标：一方面，他们的目标是让玩家
参与到一场具有挑战性的战斗里，另一方面，他们的目标又是把玩家引导到有趣的地方让体验的心流保持在最理想的
区域。
** 透镜描述
角色应该完全满足他们在游戏中扮演的角色，但只要可能，他们也要成为服从游戏设计师的仆役，为设计师的目标而
努力，建立玩家的体验。
为确保你的角色是为这种责任而生的，问：
我希望玩家体验到什么？
如何让角色能满足这些体验，且不损害他们在游戏中目标？


* 透镜#75 玩家的化身透镜
玩家化身是玩家进入游戏的世界里的门户。为了确保这些化身能带出玩家尽可能的认同，问一下自己以下问题：
** 游戏中的化身是一种吸引玩家的理想人型吗？
** 游戏中的化身有着能让玩家投射到角色上的图形抽象化的特征吗？
** 实际经验
Irene 早期版本，玩家化身特别小，在场景中都看不清，弱小，不起眼，让玩家没有认同感。

* 透镜#82 内在矛盾的透镜
Free from inner contradictions-----毫无内在矛盾
毫无内在矛盾对于任何设计师来说都是极为重要的，因为内在矛盾是糟糕设计的本质。
一个好的游戏不能包含了抵触游戏最关键的目的的特征。为了移出这些矛盾的特征，问一下自己下面的问题：
** 透镜描述
*** 我的游戏的目的是什么？
   给玩家轻松、幽默、懒惰的娱乐。
*** 我游戏中的每个子系统的目的是什么？
   需要列表。
*** 在我游戏中，有什么东西是从根本上抵触这些目的的呢？
  
*** 倘若这样，如何才能改变这种情况呢？

** 扩展描述
   “内在矛盾”是任何糟糕的设计的本质。
   假设一个设施能让我生活变得更轻松，但它却很难用;------矛盾
   假设某样东西应该很有趣的，但用起来却无聊而且烦人-----矛盾
   一个好的设计师必须小心地去除所有内在的矛盾，不要给它们找借口。 
** 应用
  <大明>中，内在的矛盾表现在，本来我们游戏是轻松休闲玩法特别的，那么下面就会成为内在矛盾：
   1. 难用的界面 ------界面难用，不合适我们轻松的玩法
   2. 常见的、普通的厚重的玩法------如果出现类似大闹天宫的玩法，就厚重了，对我们游戏是矛盾。
   3. 让玩家难以理解的玩法--------“难以理解”，这个太糟糕了，现在的技能以及技能升级效果，都是玩家无法理解的。
   4. 平庸的玩法，无亮点和惊喜感-----平庸本来就是和我们目标矛盾的。
** 设计招式
  Christopher Alexander解释到：只有通过对该样事物的使用过程进行不断的迭代和观察，如此才能达到真正出色的设计。也就是：
循环的法则对于建筑学和游戏设计是一样通用的。
他用具体例子说明：当在一个复杂的建筑群的建筑间铺设道路的时候，可先没有路，只是种上草。然后一年后，看看人们在草地上走出什么样的
道路，再以此铺设道路。
这个思路与《精益创业》的方法有异曲同工之妙，直接瞄准用户的需求。


* 透镜#83 道之生动15特征的透镜
一些事情或物品或产品，因为其自然而有机的设计，而让人感受很棒，很特殊。例如iphone，糖果等。
建筑学家Alexander总结了生命现象的十五个特征，可用于设计。

** 层次结构
We see levels of scale in “telescoping goals, ” where a player has
to satisfy short-term goals to reach mid-term ones and to eventually reach longterm
goals. We see it in fractal interest curves. We also see it in nested game
world structures. Spore is a symphony of levels of scale.
目标是有层次结构的。
分形的兴趣曲线是有层次结构的。
游戏世界是有层次结构的。

** 强大的中心
We see this in visual layout, certainly, but also in our story
structure. The avatar is at the center of our game universe — and generally we
prefer strong avatars over weak ones. Also, we prefer strong centers when it
comes to our purpose in the game — our goal.
在视觉摆放上，在故事结构上，我们都看到了强大的中心。

** 边界
Many games are primarily about boundaries! Certainly any game
about territory is an exploration of boundaries. But rules are another kind of
boundary, and a game with no rules is no game at all.
游戏规则是一种边界。
许多游戏是关于边界的。

** 交替性重复
We see this on the pleasing shape of the chessboard, and
we see it too in the cycle of level/boss/level/boss that comes up in so many games.
Even tense/release/tense/release is an example of pleasing alternating repetition.

在游戏中有许多交替性重复出现。
1. 形状：棋盘
2. 游戏内容安排：关卡-BOSS-关卡-BOSS
3. 体验： 紧张-放松-紧张-放松

** 正交空间
What Alexander means here is that the foreground and background
elements both have beautiful, complementary shapes, like Yin and Yang.
In a sense a well-balanced game has this quality — allowing multiple alternate
strategies to have an interlocked beauty.
如同阴阳，后景与前景元素，有美丽的、相互补偿的形状。
平衡得很好的游戏中，也有类似东西--多个相互替补的策略，形成深锁的美丽。

** 好的形状
This is as simple as it sounds — a shape that is pleasing. We certainly
look for this in the visual elements of our games. But we can see and feel
it, too, in level design. A good level feels “solid” and has a “good curve. ”
好的形状体现在视觉设计上。
好的形状体现在关卡设计上。
好的关卡设计，让人感觉实在，而且有很好的曲线。

** 局部对称
This is different from an overall symmetry, like a mirror
image; instead referring to multiple small, internal symmetries in a design.
Zelda: The Wind Waker has this feeling throughout its architecture — when you
are within a room or area, it seems to have a symmetry, but it is connected to
other places in a way that feels organic. Rule systems and game balance can
have this property as well.
是设计中，多个细小的、内在的对称，而不是全局对称。
在空间设计中，有这种局部对称，例如Zelda
在规则系统设计，游戏平衡设计中，也有这种特性。

** 深度互锁与暧昧

相互对立而相互成立---围棋的黑白，道德经中的难易相成，高下相倾。缺其一，则另一东西也消失。

** 对比
In games we have many kinds of contrast. The contrast between
opponents, between what is controllable and what is not, and between reward
and punishment. When opposites in our game are strongly contrasted, the game
feels more meaningful and more powerful.
游戏中有太多对比。
如果对比强烈，游戏看起来更加有意义，更加强大。

** 梯度
This refers to qualities that change gradually. The gradually increasing
challenge curve is an example of this, but so are appropriately designed
probability curves.
事物逐渐的变化。
难度曲线的逐步提升。
概率曲线的逐步变化。

** 瑕疵
When a game is too perfect, it has no character. The handmade
feeling of “ house rules ” often makes a game seem more alive.
太完美就不好了，出现点小问题就好了。

