game_design_notes.html
<div id="outline-container-sec-53-7-3" class="outline-4">
<h4 id="sec-53-7-3"><span class="section-number-4">53.7.3</span> 我能设定各种目标来让玩家做这些事情吗？</h4>
</div>
<div id="outline-container-sec-53-7-4" class="outline-4">
<h4 id="sec-53-7-4"><span class="section-number-4">53.7.4</span> 我能设定界面来让玩家做这些事情吗？</h4>
</div>
<div id="outline-container-sec-53-7-5" class="outline-4">
<h4 id="sec-53-7-5"><span class="section-number-4">53.7.5</span> 我能用视觉设计来让玩家做这些事情吗？</h4>
</div>
<div id="outline-container-sec-53-7-6" class="outline-4">
<h4 id="sec-53-7-6"><span class="section-number-4">53.7.6</span> 我能用角色来让玩家做这些事情吗？</h4>
</div>
<div id="outline-container-sec-53-7-7" class="outline-4">
<h4 id="sec-53-7-7"><span class="section-number-4">53.7.7</span> 我能用音乐（音效）来让玩家做这些事情吗？</h4>
</div>
<div id="outline-container-sec-53-7-8" class="outline-4">
<h4 id="sec-53-7-8"><span class="section-number-4">53.7.8</span> 还有什么方法，我能用来控制玩家，但又没有侵害玩家的自由感？</h4>
<div class="outline-text-4" id="text-53-7-8">
<p>
应该是行为-奖励这种模式吧，参考skiner-box
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-54" class="outline-2">
<h2 id="sec-54"><span class="section-number-2">54</span> 透镜#73  合谋的透镜</h2>
<div class="outline-text-2" id="text-54">
<p>
其实这个透镜，就是综合应用间接控制的透镜。
设计师和游戏角色一起合谋，为玩家创造最优体验，把目标，角色和视觉设计都朝着单个统一的效果联合在一起。
实际例子：
《海盗之战》在5分钟之内创造优异的互动体验：我们让角色有两个同时并存的目标：一方面，他们的目标是让玩家
参与到一场具有挑战性的战斗里，另一方面，他们的目标又是把玩家引导到有趣的地方让体验的心流保持在最理想的
区域。
</p>
</div>
<div id="outline-container-sec-54-1" class="outline-3">
<h3 id="sec-54-1"><span class="section-number-3">54.1</span> 透镜描述</h3>
<div class="outline-text-3" id="text-54-1">
<p>
角色应该完全满足他们在游戏中扮演的角色，但只要可能，他们也要成为服从游戏设计师的仆役，为设计师的目标而
努力，建立玩家的体验。
为确保你的角色是为这种责任而生的，问：
我希望玩家体验到什么？
如何让角色能满足这些体验，且不损害他们在游戏中目标？
</p>
</div>
</div>
</div>

<div id="outline-container-sec-55" class="outline-2">
<h2 id="sec-55"><span class="section-number-2">55</span> 透镜#75 玩家的化身透镜</h2>
<div class="outline-text-2" id="text-55">
<p>
玩家化身是玩家进入游戏的世界里的门户。为了确保这些化身能带出玩家尽可能的认同，问一下自己以下问题：
</p>
</div>
<div id="outline-container-sec-55-1" class="outline-3">
<h3 id="sec-55-1"><span class="section-number-3">55.1</span> 游戏中的化身是一种吸引玩家的理想人型吗？</h3>
</div>
<div id="outline-container-sec-55-2" class="outline-3">
<h3 id="sec-55-2"><span class="section-number-3">55.2</span> 游戏中的化身有着能让玩家投射到角色上的图形抽象化的特征吗？</h3>
</div>
<div id="outline-container-sec-55-3" class="outline-3">
<h3 id="sec-55-3"><span class="section-number-3">55.3</span> 实际经验</h3>
<div class="outline-text-3" id="text-55-3">
<p>
Irene 早期版本，玩家化身特别小，在场景中都看不清，弱小，不起眼，让玩家没有认同感。
</p>
</div>
</div>
</div>


<div id="outline-container-sec-56" class="outline-2">
<h2 id="sec-56"><span class="section-number-2">56</span> 透镜77 角色性格特征的透镜</h2>
<div class="outline-text-2" id="text-56">
<p>
为了确保一个角色的性格特征能在他所说所做里体现出来，问：
</p>
</div>
<div id="outline-container-sec-56-1" class="outline-3">
<h3 id="sec-56-1"><span class="section-number-3">56.1</span> 哪些性格特征界定了我的角色？</h3>
</div>
<div id="outline-container-sec-56-2" class="outline-3">
<h3 id="sec-56-2"><span class="section-number-3">56.2</span> 这些性格特征如何在角色的言语、行为和外观上表露出来？</h3>
</div>

<div id="outline-container-sec-56-3" class="outline-3">
<h3 id="sec-56-3"><span class="section-number-3">56.3</span> 《饥荒》</h3>
<div class="outline-text-3" id="text-56-3">
<p>
饥荒角色性格塑造得很成功，栩栩如生，给游戏加分了。
科学家角色，面貌像一个知识分子，见到下雨会说“H2O”， 见到大树会说“感谢树木对我们的保护”，很有科学家的风格。
放火女郎，面貌是一个女子，带着打火机。紧张的时候，随便放火，看到树会说“这货可以燃”，看到荆棘会说“它比别的东西烧得更好”
</p>
</div>
</div>
</div>

<div id="outline-container-sec-57" class="outline-2">
<h2 id="sec-57"><span class="section-number-2">57</span> 透镜#82 内在矛盾的透镜</h2>
<div class="outline-text-2" id="text-57">
<p>
Free from inner contradictions&#x2013;&#x2014;毫无内在矛盾
毫无内在矛盾对于任何设计师来说都是极为重要的，因为内在矛盾是糟糕设计的本质。
一个好的游戏不能包含了抵触游戏最关键的目的的特征。为了移出这些矛盾的特征，问一下自己下面的问题：
</p>
</div>
<div id="outline-container-sec-57-1" class="outline-3">
<h3 id="sec-57-1"><span class="section-number-3">57.1</span> 透镜描述</h3>
<div class="outline-text-3" id="text-57-1">
</div><div id="outline-container-sec-57-1-1" class="outline-4">
<h4 id="sec-57-1-1"><span class="section-number-4">57.1.1</span> 我的游戏的目的是什么？</h4>
<div class="outline-text-4" id="text-57-1-1">
<p>
给玩家轻松、幽默、懒惰的娱乐。
</p>
</div>
</div>

<div id="outline-container-sec-57-1-2" class="outline-4">
<h4 id="sec-57-1-2"><span class="section-number-4">57.1.2</span> 我游戏中的每个子系统的目的是什么？</h4>
<div class="outline-text-4" id="text-57-1-2">
<p>
需要列表。
</p>
</div>
</div>

<div id="outline-container-sec-57-1-3" class="outline-4">
<h4 id="sec-57-1-3"><span class="section-number-4">57.1.3</span> 在我游戏中，有什么东西是从根本上抵触这些目的的呢？</h4>
</div>

<div id="outline-container-sec-57-1-4" class="outline-4">
<h4 id="sec-57-1-4"><span class="section-number-4">57.1.4</span> 倘若这样，如何才能改变这种情况呢？</h4>
</div>
</div>
<div id="outline-container-sec-57-2" class="outline-3">
<h3 id="sec-57-2"><span class="section-number-3">57.2</span> 扩展描述</h3>
<div class="outline-text-3" id="text-57-2">
<p>
“内在矛盾”是任何糟糕的设计的本质。
假设一个设施能让我生活变得更轻松，但它却很难用;&#x2014;&#x2014;矛盾
假设某样东西应该很有趣的，但用起来却无聊而且烦人&#x2013;&#x2014;矛盾
一个好的设计师必须小心地去除所有内在的矛盾，不要给它们找借口。 
</p>
</div>
</div>

<div id="outline-container-sec-57-3" class="outline-3">
<h3 id="sec-57-3"><span class="section-number-3">57.3</span> 应用</h3>
<div class="outline-text-3" id="text-57-3">
<p>
&lt;大明&gt;中，内在的矛盾表现在，本来我们游戏是轻松休闲玩法特别的，那么下面就会成为内在矛盾：
</p>
<ol class="org-ol">
<li>难用的界面 &#x2014;&#x2014;界面难用，不合适我们轻松的玩法
</li>
<li>常见的、普通的厚重的玩法&#x2014;&#x2014;如果出现类似大闹天宫的玩法，就厚重了，对我们游戏是矛盾。
</li>
<li>让玩家难以理解的玩法&#x2013;&#x2014;&#x2014;“难以理解”，这个太糟糕了，现在的技能以及技能升级效果，都是玩家无法理解的。
</li>
<li>平庸的玩法，无亮点和惊喜感&#x2013;&#x2014;平庸本来就是和我们目标矛盾的。
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-57-4" class="outline-3">
<h3 id="sec-57-4"><span class="section-number-3">57.4</span> 设计招式</h3>
<div class="outline-text-3" id="text-57-4">
<p>
  Christopher Alexander解释到：只有通过对该样事物的使用过程进行不断的迭代和观察，如此才能达到真正出色的设计。也就是：
循环的法则对于建筑学和游戏设计是一样通用的。
他用具体例子说明：当在一个复杂的建筑群的建筑间铺设道路的时候，可先没有路，只是种上草。然后一年后，看看人们在草地上走出什么样的
道路，再以此铺设道路。
这个思路与《精益创业》的方法有异曲同工之妙，直接瞄准用户的需求。
</p>
</div>
</div>
</div>

<div id="outline-container-sec-58" class="outline-2">
<h2 id="sec-58"><span class="section-number-2">58</span> 透镜#83 道之生动15特征的透镜</h2>
<div class="outline-text-2" id="text-58">
<p>
一些事情或物品或产品，因为其自然而有机的设计，而让人感受很棒，很特殊。例如iphone，糖果等。
建筑学家Alexander总结了生命现象的十五个特征，可用于设计。
</p>
</div>

<div id="outline-container-sec-58-1" class="outline-3">
<h3 id="sec-58-1"><span class="section-number-3">58.1</span> 层次结构</h3>
<div class="outline-text-3" id="text-58-1">
<p>
We see levels of scale in “telescoping goals, ” where a player has
to satisfy short-term goals to reach mid-term ones and to eventually reach longterm
goals. We see it in fractal interest curves. We also see it in nested game
world structures. Spore is a symphony of levels of scale.
目标是有层次结构的。
分形的兴趣曲线是有层次结构的。
游戏世界是有层次结构的。
</p>
</div>
</div>
<div id="outline-container-sec-58-2" class="outline-3">
<h3 id="sec-58-2"><span class="section-number-3">58.2</span> 强大的中心</h3>
<div class="outline-text-3" id="text-58-2">
<p>
We see this in visual layout, certainly, but also in our story
structure. The avatar is at the center of our game universe — and generally we
prefer strong avatars over weak ones. Also, we prefer strong centers when it
comes to our purpose in the game — our goal.
在视觉摆放上，在故事结构上，我们都看到了强大的中心。
</p>
</div>
</div>
<div id="outline-container-sec-58-3" class="outline-3">
<h3 id="sec-58-3"><span class="section-number-3">58.3</span> 边界</h3>
<div class="outline-text-3" id="text-58-3">
<p>
Many games are primarily about boundaries! Certainly any game
about territory is an exploration of boundaries. But rules are another kind of
boundary, and a game with no rules is no game at all.
游戏规则是一种边界。
许多游戏是关于边界的。
</p>
</div>
</div>
<div id="outline-container-sec-58-4" class="outline-3">
<h3 id="sec-58-4"><span class="section-number-3">58.4</span> 交替性重复</h3>
<div class="outline-text-3" id="text-58-4">
<p>
We see this on the pleasing shape of the chessboard, and
we see it too in the cycle of level/boss/level/boss that comes up in so many games.
Even tense/release/tense/release is an example of pleasing alternating repetition.
</p>

<p>
在游戏中有许多交替性重复出现。
</p>
<ol class="org-ol">
<li>形状：棋盘
</li>
<li>游戏内容安排：关卡-BOSS-关卡-BOSS
</li>
<li>体验： 紧张-放松-紧张-放松
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-58-5" class="outline-3">
<h3 id="sec-58-5"><span class="section-number-3">58.5</span> 正交空间</h3>
<div class="outline-text-3" id="text-58-5">
<p>
What Alexander means here is that the foreground and background
elements both have beautiful, complementary shapes, like Yin and Yang.
In a sense a well-balanced game has this quality — allowing multiple alternate
strategies to have an interlocked beauty.
如同阴阳，后景与前景元素，有美丽的、相互补偿的形状。
平衡得很好的游戏中，也有类似东西&#x2013;多个相互替补的策略，形成深锁的美丽。
</p>
</div>
</div>
<div id="outline-container-sec-58-6" class="outline-3">
<h3 id="sec-58-6"><span class="section-number-3">58.6</span> 好的形状</h3>
<div class="outline-text-3" id="text-58-6">
<p>
This is as simple as it sounds — a shape that is pleasing. We certainly
look for this in the visual elements of our games. But we can see and feel
it, too, in level design. A good level feels “solid” and has a “good curve. ”
好的形状体现在视觉设计上。
好的形状体现在关卡设计上。
好的关卡设计，让人感觉实在，而且有很好的曲线。
</p>
</div>
</div>
<div id="outline-container-sec-58-7" class="outline-3">
<h3 id="sec-58-7"><span class="section-number-3">58.7</span> 局部对称</h3>
<div class="outline-text-3" id="text-58-7">
<p>
This is different from an overall symmetry, like a mirror
image; instead referring to multiple small, internal symmetries in a design.
Zelda: The Wind Waker has this feeling throughout its architecture — when you
are within a room or area, it seems to have a symmetry, but it is connected to
other places in a way that feels organic. Rule systems and game balance can
have this property as well.
是设计中，多个细小的、内在的对称，而不是全局对称。
在空间设计中，有这种局部对称，例如Zelda
在规则系统设计，游戏平衡设计中，也有这种特性。
</p>
</div>
</div>
<div id="outline-container-sec-58-8" class="outline-3">
<h3 id="sec-58-8"><span class="section-number-3">58.8</span> 深度互锁与暧昧</h3>
<div class="outline-text-3" id="text-58-8">
<p>
相互对立而相互成立&#x2014;围棋的黑白，道德经中的难易相成，高下相倾。缺其一，则另一东西也消失。
</p>
</div>
</div>
<div id="outline-container-sec-58-9" class="outline-3">
<h3 id="sec-58-9"><span class="section-number-3">58.9</span> 对比</h3>
<div class="outline-text-3" id="text-58-9">
<p>
In games we have many kinds of contrast. The contrast between
opponents, between what is controllable and what is not, and between reward
and punishment. When opposites in our game are strongly contrasted, the game
feels more meaningful and more powerful.
游戏中有太多对比。
如果对比强烈，游戏看起来更加有意义，更加强大。
</p>
</div>
</div>
<div id="outline-container-sec-58-10" class="outline-3">
<h3 id="sec-58-10"><span class="section-number-3">58.10</span> 梯度</h3>
<div class="outline-text-3" id="text-58-10">
<p>
This refers to qualities that change gradually. The gradually increasing
challenge curve is an example of this, but so are appropriately designed
probability curves.
事物逐渐的变化。
难度曲线的逐步提升。
概率曲线的逐步变化。
</p>
</div>
</div>
<div id="outline-container-sec-58-11" class="outline-3">
<h3 id="sec-58-11"><span class="section-number-3">58.11</span> 瑕疵</h3>
<div class="outline-text-3" id="text-58-11">
<p>
When a game is too perfect, it has no character. The handmade
feeling of “ house rules ” often makes a game seem more alive.
太完美就不好了，出现点小问题就好了。
</p>
</div>
</div>
