game_design_notes.org
** 回音
Echoes are a kind of pleasing, unifying repetition. When the boss monster
has something in common with his minions, we are experiencing echoes.
Good interest curves have this property, especially fractal ones.

一种愉悦的、统一的重复。
BOSS在某方面类似小鬼，我们就看见了回音。
好的兴趣曲线有这样的特性，尤其是那种分形的。

** 空洞
As Alexander says, “In the most profound centers which have perfect
wholeness, there is at the heart a void which is like water, infinite in depth, surrounded
by and contrasted with the clutter of the stuff and fabric all around it. ”
Think of a church, or the human heart. When boss monsters tend to be in large,
hollow spaces, we are experiencing the void.

寂兮渺兮
当其无，有器之用。
当其无，有室之用。
有之以为利，无之以为用。


** 简洁与内在平静
Designers talk endlessly about how important it is
for a game to be simple — usually with a small number of rules that have emergent
properties. Of course, these rules must be well-balanced, which gives them
the inner calm that Alexander describes.

简单规则导致的自发性特征，是游戏设计者的追求。
规则必须平衡，有内在平静。
围棋有此特征，因为其规则简单到了极致，而自发空间那么巨大。

** 有机融合（非独立性）
This refers to something being well-connected to its surroundings
— as if it was part of them. Each rule of our game should have this property,
but so should every element of our game. If everything in our game has this
quality, a certain wholeness results that makes the game feel very alive indeed.

任何部分，都有机融入环境中，是环境的组成部分，没有突兀出现的东西，格格不入的东西。
如果我们游戏所有部分都有这种特性，那么就会产生一个总体感---使游戏感受很具生命活力。


** 道之物化
上述15个特征，其实是道德经中许多抽象原则的具体化。
道，无所不在。
尊道而行，设计也需如此。



* 实战
学习《游戏设计的艺术后》，进行了下面的实战：
** 浮生历程的设计。
玩家每打过一个城市，就有这个城市的Flash剧情，未打过的不开剧情。城市之间单线条连接起来。
应用了：

***  进展可见透镜：玩家的游戏进展是可见的。
***  好奇心透镜：玩家会好奇，下一个城市flash是什么？

** 采集场的设计
原来的设计，玩家一按按钮，就随机得到特产或者宝石。
我的设计，界面上有特产和宝石按钮，玩家自行选择按哪个，分别得到结果。
应用了：
*** 有意义的选择的透镜。  
让玩家感觉，我参与了，得到的东西是我操作的结果。
** 太学设计
  为玩家下阵的伙伴提供经验。我的设计概要：若干城市有“太学”，提供免费的50个位置，玩家可以把自己的伙伴送到太学学习，一个伙伴
占一个位置。如果没有位置了，就得等。应用了：
***  本质体验的透镜： 这种体验是玩家可接受的
***  玩家的透镜：我们游戏的玩家不愿意理解费解的东西
***  自发性的透镜之 “5. 会改变约束条件的副作用效果。
  每当你采取一个行动，它所带来的副作用都会改变你自己或你的对手的约束情况，那是很有趣的。 例子：
  在跳棋中，你移动一个旗子，你不但改变了你可能被吃掉的格局，还改变了你对手（以及你自己）可以移动的格局。在这个意义上，  每一步都改变了游戏空间的本质，
无论这种改变是你希望或者不希望的。”。 -----我的设计中，玩家伙伴的学习占了位置，改变了你的对手（别的玩家）的格局。
   
** 《绝对领域》的改进
缘由：《绝对领域》立项8个月之后，完成度低，前期感受差，各方面评价不佳。
因此，做了下面的改进：
*** 更美的开场画面
原来开篇剧情画面品质很差，玩家感受这游戏没诚意。决定重修，提升画面品质。
参见透镜#63: 美好事物的透镜。
*** 增加前十分钟场景数量，并使场景：1.更美更细腻 2. 场景之间有显著差异
原来版本前十分钟体验过程中，只有两个很烂的场景，玩家在第二个场景中打怪停留时间很长，厌倦。玩家觉得游戏不精致，而且闷。
改进原理如下：
透镜#63: 美好事物的透镜。
透镜#61：兴趣曲线的透镜。---->通过改变场景，让玩家见到相互之间差异大的场景，提振兴趣。
*** 简化剧情，剧情人物都改为目标玩家熟悉的日本动漫人物，编一个让玩家救公主的烂俗故事
原来的剧情复杂而且不被玩家熟知，是360腾讯百度迅雷等一大堆人物之间复杂恩怨情仇，问题在于：1 玩家识别不了这些人物，缺乏代入感。2 在短短十分钟内，玩家完全无法理解这些人物之间的关系，
剧情陷入不被玩家理解的苦中。3 更严重的是，玩家不知道自己的目标，尤其是终极目标，因此打怪无意义了。
改进的原理如下：
透镜16  玩家的透镜----》让玩家无脑就能理解剧情。
透镜16  玩家的透镜----》让玩家发现自己熟悉的日本动漫人物，兴趣提升。（玩家喜欢什么？玩家希望在你游戏中看到什么？）
*** 在简化剧情同时，给予玩家可以理解的浅显的目标
见上面剧情改动的分析描述，给了玩家终极目标或说使命感。
而且为了让这个使命感更强烈，外加了一张魔王快要欺负公主的单独的图。
改进的原理如下：
透镜#25  目标的透镜

*** 让玩家在前十分钟内，形象由猥琐变得英俊帅气
原来的一击男形象猥琐呆，虽然一看有特点，但如果要让玩家把它当自己avatar，是完全不行的。
一击男的形象改变，给了玩家惊喜感。
改进原理如下：
透镜#2, 惊喜感
透镜#75, 玩家化身的透镜

实践证明，上述改动是有效果的。

* 基于混搭的头脑风暴技术
Brainstorm Tip #13: Mix and Match Categories
It’s great when game ideas, Athena-like, spring forth from your head, fully formed.
But it doesn’t happen that way every time. A great technique for helping ideas come
together is to brainstorm in categories. The elemental tetrad comes in handy here.
For example, you might have decided you want to make a game for teenage girls.
You might make separate lists, which you can start to mix and match. Something
like
Technology Ideas
1. Cell phone platform
2. Handheld game
3. PC
4. Integrated with instant messaging
5. Game console
Mechanics Ideas
1. Sims-like game
2. Interactive fiction game
3. The winner makes the most friends
4. Try to spread rumors about the other players
5. Try to help as many people as possible
6. Tetris-like game
Story Ideas
1. High school drama
2. College-themed
3. You play cupid
4. You’re a TV star
5. Hospital theme
72
FIFTEEN NITTY-GRITTY BRAINSTORMING TIPS
6. Music theme
a. You’re a rock star
b. You’re a dancer
Aesthetic Ideas
1. Cel shaded
2. Anime style
3. All characters are animals
4. R&B music defines the game
5. Edgy rock/punk music defines the feel
Once you have lists like these (though you should have dozens more entries on
each list!) you are free to start mixing and matching ideas — maybe a cell-phone-
based Tetris-like game, which has a hospital theme, where all the characters are
animals.... Or how about a Sims-like console game based on high school with
an anime style? By having all these lists of partial ideas that can easily be mixed
and matched, fully formed game ideas that you might never have thought of start
springing up all over the place, each taking on a life of their own. Don’t be afraid to
make up other categories, either, as you need them!

我要批注   混搭有时能突破人的思维局限，创造出意想不到的好创意。
         计算机可以用来做这个，其实质就是机械地实现乘法原理。A=BxCxDxE, B,C,D,E就是各个组成部件，A的空间很大。可以使用脚本语言来找出A,
然后通过人来在A中选择有意义的组合（子集合）作为创意集。
* 从bafang学到的游戏设计思想

  1. 找你妹一的亮点：这货是什么？制作精良的基础上要维持这个。（要在制作时，故意搞得玩家看不懂）给玩家炒点。

  2. 要设计一些坑爹的东西：梨不是甜的、发光的东西包括戒指上有光点。做一些让失败换取的教训。

  3. 让玩家感觉不来就亏了。（我花了163把5条命的上限扩展到8条）
主动给玩家的，玩家不觉得有价值
让玩家感觉不拿就亏，这才有价值。


  4. 一战到底最成功的地方，在于看到别人犯错尤其是那种低级错误，获得“自己很聪明”的满足感，战胜别人的优越感。


  5. 故意设计一些玩家占便宜的点。也就是，玩家自以为发现了某个设计漏洞，占了便宜。其实这个是游戏设计者故意设计的，玩家的
反馈在预料范围内。

  6. 游戏特色只有一个，不要做大杂烩。国产山寨手机什么功能都往上堆，但就是缺特色和感觉。iPhone有缺点，大家让改，乔帮主就是不改。

  
* 作者Jesse的补充

还有一些从前我不明白的道理，现在能更好地理解，其中一些如下。

** 1. 故事发展中“奇幻”的重要性——“奇幻”被证明远比故事本身更重要。

