game_design_notes.org
** 2. 大脑中寻找快乐和避免痛苦的系统是分离的。
这有助于解释为什么游戏开始时给予的很多奖励，会逐渐成为玩家的拖累（如回来收割庄稼，或为你所在的团队服务），并往往最终导致“退出时刻”的来临——玩家选择停止游戏。

** 3. 自决理论。
它是关于人类动机和人格的宏观理论，同时也是关于心理需要的理论。它关注一个人可以在不受外界因素干扰而作出自己选择的自由和权力，它是游戏设计的核心。
[自决理论（Self-Determination Theory，简称SDT）是关于人类动机
和人格的宏观理论，同时也是关于人类本身的进化趋势以及其心理需
要的理论。它关注人们在不受外部因素干扰条件下所做出的选择背后
的动机，重点关注一个人的行为由内在动机和自我决定引发而产生的
程度 (Deci & Ryan, 2002)。简单地说，就是一个人可以有不受外界
任何因素干扰而做出自己的选择的自由和权力。]

** 移动游戏的特殊
移动游戏的设计与众不同——部分原因是触摸操控带来的，还有部分原因是玩家的心态不同——玩家在手机上预期随时被打断。

这意味着，为手机设计游戏，一方面需要充分利用触控，另一方面还要优化被打断的情况。

有趣的是，为平板电脑设计游戏不需要太多考虑玩家被打断的情况——人们倾向在更私人的空间使用平板电脑。然而对平板电脑来说，触摸更加重要。

** 功夫在诗外，不断尝试，不断创新

中国有句古话“汝果欲学诗，功夫在诗外”。同样的情况适用于游戏设计领域吗？如果是，学习游戏设计应当朝着什么方向用功？ 初级设计师与资深设计师之间的差异是什么？

Jesse：是的，完全如此！对于游戏设计师来说，只研究那些最流行、最复杂的游戏是错误的。如果希望在市场竞争中获胜，你需要研究竞争对手——但不能只研究竞争对手。

若想成为一名优秀的游戏设计师，万勿复制他人的作品——而是应当观察生活中的每个角落。灵感可以源自任何地方——而且出处越独特，你设计的游戏也越有个性。

你没法阻止旁人复制你的想法，但市场本身的规律是淘汰同质化作品。

为了获得成功，你必须一次接一次不断尝试。几乎没人能一蹴而就——而且假使这次成功了，也不能确保下一次成功。

就如任何其他技艺一样——你必须不断创造，才能逐渐提高自己的能力。

《程序员》：当你开始设计一款新游戏，会采用怎样的流程？

Jesse：这还得看具体情况，每款游戏多有不同。有时我从一个问题出发，有时跟随莫名的灵感。

大多数时候，我开始做一件事，随即发现行不通，于是我开始做其他尝试，又发现行不通，再做其他尝试……大约上百次其他尝试之后，我终于能发现某些可以行得通的方案。

* 透镜101：正能量的透镜
相同一个内容，可以用不同的方式来表达，可以让玩家有完全不同的感受。
尽量用充满正力量的、乐观的、积极的、鼓励的、向上的方式与玩家交流沟通或展示。

（例如：1、手机游戏界面上的关闭按钮有两种表达方式，一个是右上角放一个“×”，一个是右下角放一个“√”。

2、将冷冰冰的“提示”改用语气词(哇哦！)或称赞词（恭喜你/你真棒！））

问一下你自己：

你的设计是不是可以用另外一种方式来表达，更能够让人接受呢？

你的设计是不是可以用另外一种方式来表达，更能够让玩家充满爱，感恩和power呢！
* 透镜102：得到失去的透镜
让玩家有得到的感觉，尽量减少失去的感觉。
原理：
同样数量N的<奖励|物品|...>，
1. 玩家喜欢的是由少到多的变化过程，以至于到N
 原因：喜欢得到。
 
2. 玩家不喜欢的是由多到少的变化过程，以至于到N
 原因：讨厌失去。

案例：
巴fang说的那个卖糖的售货员。他的顾客最多，就是他称一斤糖，少放到秤里面，然后一点一点加上去，顾客喜欢。但有的
售货员抓一大把到秤里面，然后一点一点减少，直到一斤。然后顾客就不高兴了。


* 透镜103：尺寸的透镜
存在着两个尺寸：最优尺寸与魔法尺寸。
** 最优尺寸
对于特定设备A和它的分辨率P， 存在且仅存在最优的游戏界面尺寸S1、
人物尺寸S2、物品尺寸S3和字体尺寸S4。
我们称它为最优尺寸。
在这尺寸下，玩家感觉界面最清晰、最舒服。
如果游戏界面、物件实际尺寸小于最优尺寸，则感觉很难受，不仅看不清楚，
而且显得游戏小气、物件密集等，体验很差。

*** 来源：
项目Z的安卓版本体验不错了。
刚移植到iOS的时候，感觉特别恶心，主要是各种元素的尺寸不对。尽管游戏逻辑、
美术等，都与安卓一样，体验为什么差异那么大呢？
于是经过思考，发现了尺寸的透镜。

** 魔法尺寸
通过把某个物品或人物或怪物的尺寸搞得特别大、特别小，就能产生特别
（可怕、壮观）的感觉，提供奇特的体验。叫这个为“魔法尺寸 ”
例子：kingdom rush中，冰雪那一关，出的BOSS非常巨大，出场的时候
给了玩家很大震动。

问自己问题：
** 我们游戏的各种尺寸，是最优尺寸吗？
如果不是，应该如何达到呢？
** 我们游戏的某个object，需要用魔法尺寸吗？
为什么要用？是为了塑造一种奇怪的感觉吗？



* 透镜104： 凯尔文勋爵的透镜

一切都要量化才行。数据依据是最准确、最客观的度量标准，为游戏设计和改进提供了刚性论据。
所以需要在游戏设计、参考、改进过程中，大量使用统计学手段。
不以量化手段来做的设计和改进，是没有证据支撑的，难以成立的。
尤其是对游戏参照系的学习，要量化地学。

** 实例：


*** 以开始界面的设置按钮为例：

项目Z 的设置按钮 (75,72)
找你妹1的开始界面按钮(92,93)
农场英雄 的设置按钮 (120,117)
dump die  (79,85)
小小盗贼的设置按钮(91,96)

结论：
项目Z设置按钮太小，不仅感受到了，而且数据支持了。

最终：
改。

** 项目Z物件大小
项目Z物件在大小上，分布比找你妹1扩散，所以看起来怪怪的，证据如下。
使用R软件，分别统计101个项目Z和找你妹1物件，
z1_chang: 1的物件长度
z2_chang: 项目Z的物件长度
z1_gao: 1的物件高度
z2_gao: 项目Z的物件高度
mianji1： 1物件的面积
mianji2： 项目Z物件的面积
mean:均值
min:最小数
max:最大数
sd:标准均方差

> mean(z1_chang)
143.1287

> mean(z1_gao)
132.9802


> mean(z2_chang)
129.3762


> mean(z2_gao)
134.5347


> summary(z1_gao)
   Min. 1st Qu.  Median    Mean 3rd Qu.    Max. 
     40      96     120     133     162     258 
> summary(z2_gao)
   Min. 1st Qu.  Median    Mean 3rd Qu.    Max. 
   39.0    95.0   131.0   134.5   162.0   293.0 



> summary(z1_chang)
   Min. 1st Qu.  Median    Mean 3rd Qu.    Max. 
   32.0   109.0   146.0   143.1   169.0   380.0 



> summary(z2_chang)
   Min. 1st Qu.  Median    Mean 3rd Qu.    Max. 
   31.0    90.0   126.0   129.4   166.0   447.0 


> summary(mianji1)
   Min. 1st Qu.  Median    Mean 3rd Qu.    Max. 
   2772   11780   17430   19850   25260   75080 
> summary(mianji2)
   Min. 1st Qu.  Median    Mean 3rd Qu.    Max. 
   1829    9177   16490   18910   23710  110400 

> sd(mianji1)
 12214.73
> sd(mianji2)
 15338.41

结论

一、 项目Z的物件，大小上很不平衡，以物件面积为度量标准，表现：
A  项目Z最大的面积为110400，远远超过找你妹1的最大物件75080
B. 项目Z最小的面积为1829(一个小音符)，远小于找你妹1的最小物件2772
C. 项目Z物件的标准方差为15338.41，比找你妹1物件标准方差12214.73大。

建议：
把项目Z过于大的物件改小些，过于小的物件改大些。这样总体上分布平衡。

二、项目Z物件的长和高，最小数值与找你妹1的类似。

三、项目Z物件的高度，最大数值远远大于找你妹1物件高度的最大数值：
> summary(z1_gao)
      Max. =  258 
> summary(z2_gao)
    Max. =   293.0 

四、项目Z物件的长度，最大数值远远大于找你妹1物件长度的最大数值：
> summary(z1_chang)
   Min. 1st Qu.  Median    Mean 3rd Qu.    Max. 
   32.0   109.0   146.0   143.1   169.0   380.0 



> summary(z2_chang)
   Min. 1st Qu.  Median    Mean 3rd Qu.    Max. 
   31.0    90.0   126.0   129.4   166.0   447.0 

   建议：把项目Z特别高或特别长的物件去掉，或改得不那么高或那么长。
   
五、 项目Z物件平均面积比找你妹1的小
summary(mianji1)   Mean=19850
summary(mianji2)   Mean=18910
但有趣的是：

六： 每屏物件，找你妹1有26个，项目Z才23个。统计数据：
找你妹1平均值	25.86	 项目Z平均值	22.98

由五和六得出结论：
我们物品摆放算法导致更多空隙，所以每屏物品摆放效率比找你妹1低。


最终：
改了物件大小，200左右物件调整大了，初步效果是：看起来更美观，且更加类似找你妹1。

* 宫本茂言论
** 把游戏以外的经验带到游戏制作中去。
** 很多事情人们在生活中习以为常，但如果能换一个角度去观察他们的话，你就可以从中找到灵感的闪光。
